export const questionsUIB = [
    {
        id: 1,
        question: 'Комплекс заходів із забезпечення безпеки інформації розглядають на трьох рівнях:',
        options: [
            'Організаційному',
            'Технічному',
            'Кримінальному',
            'Правовому'
        ],
        correctAnswers: [
            'Організаційному',
            'Технічному',
            'Правовому'
        ]
    },
    {
        id: 2,
        question: 'Стеганографія - це:',
        options: [
            'Зворотній процес до шифрування',
            'Наука, що займається вивченням та розробленням методів, способів та засобів розкриття шифру',
            'Набір засобів і методів приховування факту передавання повідомлення'
        ],
        correctAnswers: [
            'Набір засобів і методів приховування факту передавання повідомлення'
        ]
    },
    {
        id: 3,
        question: 'Інформацію з обмеженим доступом поділяють на:',
        options: [
            'Конфіденційну',
            'відкриту',
            'цілком таємну',
            '"тільки нікому не кажи!"',
            'Таємну'
        ],
        correctAnswers: [
            'Конфіденційну',
            'Таємну'
        ]
    },
    {
        id: 4,
        question: 'Як мінімізувати ризик НСД',
        options: [
            'Вигадувати складні паролі',
            'Не використовувати пароль',
            'Використовувати автентифікацію двох типів',
            'Регулярно змінювати паролі'
        ],
        correctAnswers: [
            'Вигадувати складні паролі',
            'Використовувати автентифікацію двох типів',
            'Регулярно змінювати паролі'
        ]
    },
    {
        id: 5,
        question: 'З якого часу інформація вважається державною таємницею?',
        options: [
            'всі відповіді вірні',
            'з часу опублікування Зводу відомостей',
            'з часу опублікування відповідного закону',
            'з часу, коли її визнали таємною'
        ],
        correctAnswers: [
            'з часу опублікування Зводу відомостей'
        ]
    },
    {
        id: 6,
        question: `Один із найбільш поширених видів комп’ютерних порушень, який полягає в одержанні користувачем доступу до об'єкта, на який у нього немає дозволу згідно з прийнятою в даній системі політикою безпеки - це:`,
        options: [
            'безпека інформаційної системи',
            'доступність компонента(ресурсу)',
            'цілісність компонента(ресурсу)',
            'несанкціонований доступ'
        ],
        correctAnswers: [
            'несанкціонований доступ'
        ]
    },
    {
        id: 7,
        question: 'Монітор безпеки - це:',
        options: [
            'Набір процедур для підтримки бази даних імен користувачів і груп, визначених на локальній машині',
            `Компонент системи, що виконується в режимі ядра і забезпечує перевірку прав доступу до об'єктів, операції над привілеями і генерування повідомлень аудиту безпеки`,
            'Інформація про локальних користувачів та групи разом з їхніми паролями та іншими атрибутами',
            `Служба каталогів, що зберігає базу даних із відомостями про об'єкти в домені.`
        ],
        correctAnswers: [
            `Компонент системи, що виконується в режимі ядра і забезпечує перевірку прав доступу до об'єктів, операції над привілеями і генерування повідомлень аудиту безпеки`
        ],
    },
    {
        id: 8,
        question: 'Загроза це:',
        options: [
            'вплив, що призводить до зменшення цінності інформаційних ресурсів а також можуть спричинити порушення політики безпеки інформації',
            'вплив, що призводить до зменшення цінності інформаційних ресурсів.',
            'будь-які обставини чи події, що можуть спричинити порушення політики безпеки інформації та (або) нанесення збитку ІКС.'
        ],
        correctAnswers: [
            'будь-які обставини чи події, що можуть спричинити порушення політики безпеки інформації та (або) нанесення збитку ІКС.'
        ]
    },
    {
        id: 9,
        question: 'Локальне проникнення це:',
        options: [
            'Атаки, які дають змогу реалізувати віддалене керування комп ютером через мережу.',
            'Атаки, що призводять до отримання несанкціонованого доступу до вузлів, на яких вони ініційовані.',
            `Атаки, що дають змогу порушити функціонування системи або перенавантажити комп'ютер, на якому їх ініційовано.`,
            `Атаки, що дають можливість порушити функціонування системи або перенавантажити комп'ютер через мережу.`
        ],
        correctAnswers: [
            'Атаки, що призводять до отримання несанкціонованого доступу до вузлів, на яких вони ініційовані.'
        ]
    },
    {
        id: 10,
        question: 'Комплексна система захисту інформації (КСЗІ) це:',
        options: [
            'розуміють діяльність, спрямовану на забезпечення безпеки оброблюваної в ІКС інформації й ІКС у цілому, що дає змогу запобігти реалізації загроз або унеможливити її, та зменшити ймовірність завдання збитків від реалізації загроз.',
            'це сукупність організаційних, інженерних і програмно-апаратних засобів що дає змогу запобігти реалізації загроз або унеможливити її. та зменшити ймовірність завдання збитків від реалізації загроз.',
            'це сукупність організаційних, інженерних і програмно-апаратних засобів, що забезпечують захист інформації в ІКС.'
        ],
        correctAnswers: [
            'сукупність організаційних, інженерних і програмно-апаратних засобів, що забезпечують захист інформації в ІКС.'
        ]
    },
    {
        id: 11,
        question: 'Доступ це:',
        options: [
            'це взаємодія двох об’єктів обчислювальної системи, коли один із них (той. що здійснює доступ) виконує дії над іншим (тим, до якого здійснюється доступ).',
            'складова політики безпеки, що регламентує правила доступу користувачів і процесів до пасивних об’єктів.',
            'доступ, який здійснюють з порушенням політики безпеки, тобто з порушенням ПРД.'
        ],
        correctAnswers: [
            'це взаємодія двох об’єктів обчислювальної системи, коли один із них (той. що здійснює доступ) виконує дії над іншим (тим, до якого здійснюється доступ).'
        ]
    },
    {
        id: 12,
        question: "Локальна відмова в обслуговуванні це:",
        options: [
            "Атаки, що дають змогу порушити функціонування системи або перенавантажити комп'ютер, на якому їх ініційовано.",
            "Атаки, які дають змогу реалізувати віддалене керування комп'ютером через мережу.",
            "Атаки, що дають можливість порушити функціонування системи або перенавантажити комп'ютер через мережу.",
            "Атаки, що призводять до отримання несанкціонованого доступу до вузлів, на яких вони ініційовані."
        ],
        correctAnswers: [
            "Атаки, що дають змогу порушити функціонування системи або перенавантажити комп'ютер, на якому їх ініційовано."
        ]
    },
    {
        id: 13,
        question: "Що не є суб'єктом відносин, пов'язаних із захистом інформації в системах?",
        options: [
            "власники інформації",
            "спеціально уповноважений центральний орган виконавчої влади з питань організації спеціального зв'язку та захисту інформації і підпорядковані йому регіональні органи",
            "Власники системи",
            "користувачі"
        ],
        correctAnswers: [
            "спеціально уповноважений центральний орган виконавчої влади з питань організації спеціального зв'язку та захисту інформації і підпорядковані йому регіональні органи"
        ]
    },
    {
        id: 14,
        question: "Політика безпеки (інформації) це:",
        options: [
            "властивість інформації, завдяки якій уповноважені користувачі можуть використовувати її згідно з правилами, встановленими політикою безпеки, не очікуючи довше заданого (невеликого) проміжку часу.",
            "сукупність законів, правил, обмежень, рекомендацій, інструкцій тощо, які регламентують порядок оброблення інформації в ІКС. Таким чином, саме політика безпеки інформації обумовлює вживання тих чи інших заходів захисту, які дають змогу підтримувати безпеку інформації.",
            "стан інформації, в якому забезпечується збереження визначених політикою безпеки властивостей інформації. Багаторічний досвід захисту інфор-мації в ІКС дозволив визначити головні властивості інформації, збереження яких дає змогу гарантувати збереження цінності інформаційних ресурсів."
        ],
        correctAnswers: [
            "сукупність законів, правил, обмежень, рекомендацій, інструкцій тощо, які регламентують порядок оброблення інформації в ІКС. Таким чином, саме політика безпеки інформації обумовлює вживання тих чи інших заходів захисту, які дають змогу підтримувати безпеку інформації."
        ]
    },
    {
        id: 15,
        question: "Яке із означень найбільш повно відображає поняття 'система управління інформаційною безпекою'?",
        options: [
            "стратегічна інфраструктура і технічна архітектура для підтримки єдиного життєвого циклу слабоструктурованої інформації (контенту) різних типів і форматів",
            "процес, який починається при розробці стратегії і зачіпає всю діяльність організації, він спрямований на виявлення потенційних подій, які можуть впливати на організацію і управління пов'язаним з цими подіями ризиком, а також на здійснення контролю за неперевищенням ризик-апетиту організації та наданням достатньої впевненості в досягненні цілей організації",
            "програмно-технічний комплекс забезпечує функціонування єдиної системи специфікацій на засоби криптографічного захисту інформації та електронного цифрового підпису та надає організаційно-технічні засоби застосування сертифікатів відкритих ключів для вирішення наступних завдань інформаційної безпеки",
            "частина загальної системи управління організації, заснованої на оцінці бізнес ризиків, яка створює, реалізує, експлуатує, здійснює моніторинг, перегляд, супровід і вдосконалення інформаційної безпеки"
        ],
        correctAnswers: [
            "частина загальної системи управління організації, заснованої на оцінці бізнес ризиків, яка створює, реалізує, експлуатує, здійснює моніторинг, перегляд, супровід і вдосконалення інформаційної безпеки"
        ]
    },
    {
        id: 16,
        question: "Блокове шифрування - це",
        options: [
            "Спосіб шифрування даних, коли кожний знак шифрується окремо",
            "Спосіб шифрування даних, коли кожен блок, що передається не шифрується",
            "Спосіб шифрування даних, коли кожен блок, що передається може шифруватись окремо"
        ],
        correctAnswers: [
            "Спосіб шифрування даних, коли кожен блок, що передається може шифруватись окремо"
        ]
    },
    {
        id: 17,
        question: "У документі НД ТЗІ зазначено такі класи автоматизованих систем (АС):",
        options: [
            "АС клас 4",
            "АС клас 2 - локалізований багатомашинний багатокористувацький комплекс",
            "АС клас 1 - одномашинний однокористувацький комплекс",
            "АС клас 3 - розподілений багатомашинний багатокористувацький комплекс"
        ],
        correctAnswers: [
            "АС клас 2 - локалізований багатомашинний багатокористувацький комплекс",
            "АС клас 1 - одномашинний однокористувацький комплекс"
        ]
    },
    {
        id: 18,
        question: "Модель порушника це:",
        options: [
            "абстрактний формалізований чи неформалізовзний опис порушника. Моделі загроз і порушника є вихідною інформацією для розроблення політики безпеки проектування будь-яких систем захисту.",
            "абстрактний формалізований чи неформалізований опис методів і засобів здійснення загроз.",
            "абстрактний формалізований чи неформалізований опис політики безпеки. Модель безпеки використовують під час проектування системи для визначення механізмів і алгоритмів захисту, а також під час аналізу захищеності системи для перевірки й доведення коректності та достатності реалізованих механізмів."
        ],
        correctAnswers: [
            "абстрактний формалізований чи неформалізовзний опис порушника. Моделі загроз і порушника є вихідною інформацією для розроблення політики безпеки проектування будь-яких систем захисту."
        ]
    },
    {
        id: 19,
        question: "Реквізити кожного матеріального носія секретної інформації складаються із ",
        options: [
            "найменування посади та підпису особи, яка надала гриф секретності",
            "гриф секретності",
            "номера примірника",
            "всі перелічені відповіді вірні",
            "статті Зводу відомостей, що становлять державну таємницю, на підставі якої здійснюється засекречення"
        ],
        correctAnswers: [
            "всі перелічені відповіді вірні"
        ]
    },
    {
        id: 20,
        question: "Яка мета Закону України Про доступ до публічної інформації?",
        options: [
            "встановлення загальних правових основ одержання, використання, поширення та зберігання інформації, закріплення права особи на інформацію в усіх сферах суспільного і державного життя України, а також систему інформації, її джерела, визначення статусу учасників інформаційних відносин, регулювання доступу до інформації та забезпечення її охорони, захист особи та суспільства від неправдивої інформації",
            "встановлення основ регулювання правових відносин щодо захисту інформації в автоматизованих системах за умови дотримання права власності громадян України юридичних осібна інформацію та права доступу до неї, права власника інформації на її захист, а також встановленого чинним законодавством обмеження на доступ до інформації",
            "забезпечення прозорості та відкритості суб'єктів владних повноважень і створення механізмів реалізації права кожного на доступ до публічної інформації",
            "регулювання відносини у сфері захисту інформації в інформаційних, телекомунікаційних та інформаційно-телекомунікаційних системах"
        ],
        correctAnswers: [
            "забезпечення прозорості та відкритості суб'єктів владних повноважень і створення механізмів реалізації права кожного на доступ до публічної інформації"
        ]
    },
    {
        id: 21,
        question: "Якого контролю за забезпеченням доступу до публічної інформації не існує?",
        options: [
            "державний контроль",
            "громадський контроль",
            "парламентський контроль",
            "суспільний контроль"
        ],
        correctAnswers: [
            "суспільний контроль"
        ]
    },
    {
        id: 22,
        question: "Комплекс законів, правил і практичних рекомендацій, на основі яких будується управління, захист і розподіл критичної інформації в системі - це:",
        options: [
            "система захисту",
            "політика безпеки",
            "безпека інформаційної системи",
            "планування захисту інформації"
        ],
        correctAnswers: [
            "політика безпеки"
        ]
    },
    {
        id: 23,
        question: "Згідно з Законом України про доступ до публічної інформації, під терміном «публічна інформація» розуміють",
        options: [
            "відображену та задокументовану будь-якими засобами та на будь-яких носіях інформація, що була отримана або створена в процесі виконання суб'єктами владних повноважень своїх обов’язків, передбачених чинним законодавством, або яка знаходиться у володінні суб'єктів владних повноважень",
            "документовану інформацію, що дає кількісну характеристику масових явищ та процесів, які відбуваються в економічній, соціальній, культурній та інших сферах життя суспільства",
            "систематизовані, документовані, публічно оголошені або іншим чином поширені відомості про суспільне, державне життя та навколишнє природне середовище",
            "будь-які відомості та/або дані про вітчизняні та зарубіжні досягнення науки, техніки і виробництва, одержані вході науково-дослідної, дослідно- конструкторської, проектно-технологічної, виробничої та громадської діяльності, які можуть бути збережені на матеріальних носіях або відображені в електронному вигляді"
        ],
        correctAnswers: [
            "відображену та задокументовану будь-якими засобами та на будь-яких носіях інформація, що була отримана або створена в процесі виконання суб'єктами владних повноважень своїх обов’язків, передбачених чинним законодавством, або яка знаходиться у володінні суб'єктів владних повноважень"
        ]
    },
    {
        id: 24,
        question: "Чинні у країні закони, укази, нормативні акти, що регламентують правила взаємодії з інформацією обмеженого використання і відповідальність за їх порушення, які відіграють роль стримуючого чинника для потенційних порушень відносять до заходів захисту інформаційних систем:",
        options: [
            "адміністративних",
            "правових",
            "фізичних",
            "морально-етичних"
        ],
        correctAnswers: [
            "правових"
        ]
    },
    {
        id: 25,
        question: "Несанкціонований доступ (НСД)",
        options: [
            "це взаємодія двох об’єктів обчислювальної системи, коли один із них (той, що здійснює доступ) виконує дії над іншим (тим, до якого здійснюється доступ).",
            "складова політики безпеки, що регламентує правила доступу користувачів і процесів до пасивних об'єктів.",
            "доступ, який здійснюють з порушенням політики безпеки, тобто з порушенням.",
            "всі вище перераховані"
        ],
        correctAnswers: [
            "доступ, який здійснюють з порушенням політики безпеки, тобто з порушенням."
        ]
    },
    {
        id: 26,
        question: "Автентифікація це:",
        options: [
            "перевірка запропонованого ідентифікатора на відповідність об’єкту, пересвідчення в його справжності.",
            "це унікальний атрибут об’єкта, який дає змогу вирізнити об'єкт з-поміж інших. Ідентифікацією називають процедуру присвоєння ідентифікаторів об’єктам.",
            "процес роз-пізнавання об'єктів системи за їхніми мітками, або ідентифікаторами.",
            "це процедура надання користувачу визначених повноважень у системі."
        ],
        correctAnswers: [
            "перевірка запропонованого ідентифікатора на відповідність об’єкту, пересвідчення в його справжності."
        ]
    },
    {
        id: 27,
        question: "Симетричне шифрування - це",
        options: [
            "Зворотній процес до шифрування",
            "Метод коли ключі шифрування та розшифрування або однакові, або легко виводяться один з іншого",
            "це алгоритм, згідно з яким здійснюється спеціальне криптографічне перетворення інформації",
            "Метод, коли використовується два ключі(тайний і відкритий)"
        ],
        correctAnswers: [
            "Метод коли ключі шифрування та розшифрування або однакові, або легко виводяться один з іншого"
        ]
    },
    {
        id: 28,
        question: "Асиметричне шифрування - це",
        options: [
            "Метод коли ключі шифрування та розшифрування або однакові, або легко виводяться один з іншого",
            "Метод, коли використовується два ключі(таємний і відкритий)",
            "це алгоритм, згідно з яким здійснюється спеціальне криптографічне перетворення інформації",
            "Зворотній процес до шифрування"
        ],
        correctAnswers: [
            "Метод, коли використовується два ключі(таємний і відкритий)"
        ]
    },
    {
        id: 29,
        question: "Які принципи описує міжнародний стандарт ISO/IEC 27005?",
        options: [
            "Принципи для встановлення сучасних інформаційних понять та положень, засад моделі PDCATa стратегічно направлених дій у бік забезпечення інформаційної безпеки кожної організації.",
            "Принципи управління ризиками, що дозволяють керівникам і персоналу департаментів IT управляти ризиками в системах менеджменту інформаційної безпеки (ISMS).",
            "Принципи, які пропонується конкретизувати стосовно досліджуваних інформаційних технологій.",
            "Принципи, які пропонується конкретизувати стосовно досліджуваних інформаційних технологій."
        ],
        correctAnswers: [
            "Принципи управління ризиками, що дозволяють керівникам і персоналу департаментів IT управляти ризиками в системах менеджменту інформаційної безпеки (ISMS)."
        ]
    },
    {
        id: 30,
        question: "Ідентифікатор це:",
        options: [
            "процес роз-пізнавання об'єктів системи за їхніми мітками, або ідентифікаторами.",
            "перевірка запропонованого ідентифікатора на відповідність об'єкту, пересвідчення в його справжності.",
            "це унікальний атрибут об’єкта, який дає змогу вирізнити об'єкт з-поміж інших. Ідентифікацією називають процедуру присвоєння ідентифікаторів об'єктам.",
            "це процедура надання користувачу визначених повноважень у системі."
        ],
        correctAnswers: [
            "це унікальний атрибут об’єкта, який дає змогу вирізнити об'єкт з-поміж інших. Ідентифікацією називають процедуру присвоєння ідентифікаторів об'єктам."
        ]
    },
    {
        id: 31,
        question: "Процес розробки КСЗІ НЕ передбачає етапу:",
        options: [
            "верифікація проекту КСЗІ",
            "розробка технічного завдання",
            "введення в дію КСЗІ",
            "створення проекту КСЗІ",
            "розробка політики безпеки",
            "формування вимог до КСЗІ",
            "супроводження КСЗІ"
        ],
        correctAnswers: [
            "верифікація проекту КСЗІ"
        ]
    },
    {
        id: 32,
        question: "Інформація - це",
        options: [
            "відомості, які можна накопичувати, зберігати, обробляти у той або інший спосіб, передавати кому-небудь, видозмінювати форму;",
            "документовані або публічно оголошені відомості про події та явища, що відбуваються в суспільстві, державі та навколишньому природному середовищі;",
            "реляційні бази даних із установленими зв'язками між таблицями.",
            "оброблені дані, що вже передають певний зміст;"
        ],
        correctAnswers: [
            "відомості, які можна накопичувати, зберігати, обробляти у той або інший спосіб, передавати кому-небудь, видозмінювати форму;"
        ]
    },
    {
        "id": 33,
        "question": "Авторизація це:",
        "options": [
            "це унікальний атрибут об’єкта, який дає змогу вирізнити об'єкт з-поміж інших. Ідентифікацією називають процедуру присвоєння ідентифікаторів об'єктам. ІДЕНТИФІКАТОР",
            "процес роз-пізнавання об'єктів системи за їхніми мітками, або ідентифікаторами. ІДЕНТИФІКАЦІЯ",
            "перевірка запропонованого ідентифікатора на відповідність об'єкту, пересвідчення в його справжності. АУТЕНТИФІКАЦІЯ",
            "це процедура надання користувачу визначених повноважень у системі."
        ],
        "correctAnswers": [
            "це процедура надання користувачу визначених повноважень у системі."
        ]
    },
    {
        "id": 34,
        "question": "Методологія розроблення політики безпеки складається з таких пунктів:",
        "options": [
            "аналіз ризиків",
            "розроблення концепції безпеки інформації в АС",
            "реалізація КСЗІ та введення її в дію",
            "організація виконання відновлювальних робіт і забезпечення неперервного функціонування АС",
            "документальне оформлення політики безпеки",
            "визначення вимог до заходів, методів та засобів захисту",
            "добирання основних рішень із забезпечення безпеки інформації"
        ],
        "correctAnswers": [
            "аналіз ризиків",
            "розроблення концепції безпеки інформації в АС",
            "організація виконання відновлювальних робіт і забезпечення неперервного функціонування АС",
            "документальне оформлення політики безпеки",
            "визначення вимог до заходів, методів та засобів захисту",
            "добирання основних рішень із забезпечення безпеки інформації"
        ]
    },
    {
        "id": 35,
        "question": "Заходи організаційного характеру, що регламентують процеси функціонування інформаційної системи, використання її ресурсів, діяльність персоналу і т. ін. Мета цих заходів - найбільшою мірою виключити можливість реалізації загроз безпеці. Такі заходи відносять до:",
        "options": [
            "правових",
            "морально-етичних",
            "фізичних",
            "адміністративних"
        ],
        "correctAnswers": [
            "адміністративних"
        ]
    },
    {
        "id": 36,
        "question": "Загальноприйнятими способами реагування на ризики є:",
        "options": [
            "зниження ризику",
            "уникнення ризику",
            "передача ризику",
            "дослідження ризику",
            "прийняття ризику"
        ],
        "correctAnswers": [
            "зниження ризику",
            "уникнення ризику",
            "передача ризику",
            "прийняття ризику"
        ]
    },
    {
        "id": 37,
        "question": "У технічному завданні на створення комплексної системи захисту інформації наводять такі вимоги",
        "options": [
            "до організаційних, фізичних та інших заходів захисту ДОДАТКОВО",
            "до функціонального складу технічних засобів",
            "до функціонування системи у випадку форсмажорних обставин",
            "до порядку розробки і впровадження технічних засобів"
        ],
        "correctAnswers": [
            "до організаційних, фізичних та інших заходів захисту ДОДАТКОВО",
            "до функціонального складу технічних засобів",
            "до порядку розробки і впровадження технічних засобів"
        ]
    },
    {
        "id": 38,
        "question": "Згідно з Законом України «Про інформацію» під захистом інформації розуміють",
        "options": [
            "перетворення інформації з використанням спеціальних даних з метою приховування змісту інформації, підтвердження її справжності, цілісності",
            "сукупність правових, адміністративних, організаційних, технічних та інших заходів, що забезпечують збереження, цілісність інформації та належний порядок доступу до неї",
            "сукупність методів та засобів, що забезпечують цілісність, конфіденційність і доступність інформації за умов впливу на неї загроз природного або штучного характеру",
            "діяльність, спрямовану на забезпечення інженерно-технічними заходами конфіденційності, цілісності та доступності інформації"
        ],
        "correctAnswers": [
            "сукупність правових, адміністративних, організаційних, технічних та інших заходів, що забезпечують збереження, цілісність інформації та належний порядок доступу до неї"
        ]
    },
    {
        "id": 39,
        "question": "Якщо на небезпеку наражаються процеси або підпроцеси користувачів і метою таких атак є прямий вплив на перебіг процесу - його припинення, зміна привілеїв або зворотний вплив - використання зловмисником привілеїв і характеристик іншого процесу зі своєю метою, то це є загроза:",
        "options": [
            "каналам передачі даних",
            "суб’єктам інформаційної системи",
            "об’єктам інформаційної системи",
            "інформаційній системі в цілому"
        ],
        "correctAnswers": [
            "суб’єктам інформаційної системи"
        ]
    },
    {
        "id": 40,
        "question": "Віддалена відмова в обслуговуванні це:",
        "options": [
            "Атаки, що дають змогу порушити функціонування системи або переназантажити комп'ютер, на якому їх ініційовано.",
            "Атаки, що призводять до отримання несанкціонованого доступу до вузлів, на яких вони ініційовані.",
            "Атаки, що дають можливість порушити функціонування системи або перенавантажити комп'ютер через мережу.",
            "Атаки, які дають змогу реалізувати віддалене керування комп'ютером через мережу."
        ],
        "correctAnswers": [
            "Атаки, що дають можливість порушити функціонування системи або перенавантажити комп'ютер через мережу."
        ]
    },
    {
        "id": 41,
        "question": "Процедура менеджменту ризиків інформаційної безпеки включає в себе:",
        "options": [
            "визначення контексту, оцінку ризиків, розгляд ризиків, визначення ступеня допустимого ризику, інформування про ризики, моніторинг ризиків і звітність про ризики",
            "інформування про ризики, моніторинг ризиків і звітність про ризики",
            "визначення контексту, оцінку ризиків",
            "розгляд ризиків, визначення ступеня допустимого ризику"
        ],
        "correctAnswers": [
            "визначення контексту, оцінку ризиків, розгляд ризиків, визначення ступеня допустимого ризику, інформування про ризики, моніторинг ризиків і звітність про ризики"
        ]
    },
    {
        "id": 42,
        "question": "У якому випадку розпорядник інформації має право відмовити в задоволенні запиту?",
        "options": [
            "дотримано вимог до запиту на інформацію, передбачених частиною п’ятою статті 19 Закону Про доступ до публічної інформації",
            "розпорядник інформації володіє і зобов'язаний відповідно до його компетенції, передбаченої законодавством, володіти інформацією, щодо якої зроблено запит",
            "інформація, що запитується, належить до категорії інформації з обмеженим доступом відповідно до частини другої статті б Закону Про доступ до публічної інформації",
            "особа, яка подала запит на інформацію, оплатила передбачені статтею 21 Закону \"Про доступ до публічної інформації” фактичні витрати, пов'язані з копіюванням або друком"
        ],
        "correctAnswers": [
            "інформація, що запитується, належить до категорії інформації з обмеженим доступом відповідно до частини другої статті б Закону Про доступ до публічної інформації"
        ]
    },
    {
        "id": 43,
        "question": "Джерела виникнення загрози:",
        "options": [
            "суб'єкти АС",
            "доступність інформації",
            "спостережність та керованість АС",
            "суб'єкти, зовнішні відносно АС",
            "Конфіденційність",
            "Цілісність"
        ],
        "correctAnswers": [
            "суб'єкти АС",
            "суб'єкти, зовнішні відносно АС"
        ]
    },
    {
        "id": 44,
        "question": "До основних видів інформаційної діяльності відносять:",
        "options": [
            "створення, збирання, одержання, видалення",
            "зберігання, використання, поширення, блокування",
            "захист, знищення, поширення, створення",
            "Одержання, використання, поширення, зберігання"
        ],
        "correctAnswers": [
            "Одержання, використання, поширення, зберігання"
        ]
    },
    {
        "id": 45,
        "question": "Модель політики безпеки це:",
        "options": [
            "абстрактний формалізований чи неформалізований опис політики безпеки. Модель безпеки використовують під час проектування системи для визначення механізмів і алгоритмів захисту, а також під час аналізу захищеності системи для перевірки й доведення коректності та достатності реалізованих механізмів.",
            "абстрактний формалізований чи неформалізований опис порушника. Моделі загроз і порушника є вихідною інформацією для розроблення політики безпеки і проектування будь-яких систем захисту.",
            "абстрактний формалізований чи неформалізований опис методів і засобів здійснення загроз."
        ],
        "correctAnswers": [
            "абстрактний формалізований чи неформалізований опис політики безпеки. Модель безпеки використовують під час проектування системи для визначення механізмів і алгоритмів захисту, а також під час аналізу захищеності системи для перевірки й доведення коректності та достатності реалізованих механізмів."
        ]
    },
    {
        "id": 46,
        "question": "Безпека інформації це:",
        "options": [
            "стан інформації, в якому забезпечується збереження визначених по-літикою безпеки властивостей інформації. Багаторічний досвід захисту інформації в ІКС дозволив визначити головні властивості інформації, збереження яких дає змогу гарантувати збереження цінності інформаційних ресурсів.",
            "властивість інформації, завдяки якій уповноважені користувачі можуть використовувати її згідно з правилами, встановленими політикою безпеки, не очікуючи довше заданого (невеликого) проміжку часу.",
            "сукупність законів, правил, обмежень, рекомендацій, інструкцій тощо, які регламентують порядок оброблення інформації в ІКС. Таким чином, саме політика безпеки інформації обумовлює вживання тих чи інших заходів захисту, які дають змогу підтримувати безпеку інформації."
        ],
        "correctAnswers": [
            "сукупність законів, правил, обмежень, рекомендацій, інструкцій тощо, які регламентують порядок оброблення інформації в ІКС. Таким чином, саме політика безпеки інформації обумовлює вживання тих чи інших заходів захисту, які дають змогу підтримувати безпеку інформації."
        ]
    },
    {
        "id": 47,
        "question": "Цілісність інформації це:",
        "options": [
            "властивість інформації, Завдяки якій лише вповноважені користувачі мають змогу її отримувати (тобто ознайомлюватися з інформацію).",
            "властивість інформації, завдяки якій уповноважені користувачі можуть використовувати її згідно з правилами, встановленими політикою безпеки, не очікуючи довше заданого (не-великого) проміжку часу.",
            "властивість інформації, яка дає можливість лише вповноваженим користувачам її модифікувати."
        ],
        "correctAnswers": [
            "властивість інформації, яка дає можливість лише вповноваженим користувачам її модифікувати."
        ]
    },
    {
        "id": 48,
        "question": "Розпорядник інформації має надати відповідь на запит на інформацію не пізніше",
        "options": [
            "2 робочих днів з дня отримання запиту",
            "5 робочих днів з дня отримання запиту",
            "7 робочих днів з дня отримання запиту",
            "14 робочих днів з дня отримання запиту"
        ],
        "correctAnswers": [
            "5 робочих днів з дня отримання запиту"
        ]
    },
    {
        "id": 49,
        "question": "Шифрування - це",
        "options": [
            "Зворотній процес до шифрування",
            "Процес криптографічного перетворення даних, за допомогою якого відритий текст перетворюється на шифорваний з метою захисту від несанкціонованого доступу",
            "це алгоритм, згідно з яким здійснюється спеціальне криптографічне перетворення інформації"
        ],
        "correctAnswers": [
            "Процес криптографічного перетворення даних, за допомогою якого відритий текст перетворюється на шифорваний з метою захисту від несанкціонованого доступу"
        ]
    },
    {
        "id": 50,
        "question": "Документи, що регламентують певні аспекти діяльності у сфері захисту інформації, стосуються критеріїв оцінювання захищених систем та прирівнюються до державних стандартів України із захисту інформації, відомі під назвою:",
        "options": [
            "нормативні документи інформаційної безпеки",
            "стандарт TCSEC",
            "нормативні документи технічного захисту інформації",
            "специфікація комплексу засобів захисту",
            "закони України про інформацію"
        ],
        "correctAnswers": [
            "стандарт TCSEC"
        ]
    },
    {
        "id": 51,
        "question": "Віддалене проникнення це:",
        "options": [
            "Атаки, що призводять до отримання несанкціонованого доступу до вузлів, на яких вони ініційовані.",
            "Атаки, що дають можливість порушити функціонування системи або перенавантажити комп'ютер, на якому їх ініційовано.",
            "Атаки, які дають змогу реалізувати віддалене керування комп'ютером через мережу.",
            "Атаки, що дають змогу порушити функціонування системи або перенавантажити комп'ютер через мережу."
        ],
        "correctAnswers": [
            "Атаки, які дають змогу реалізувати віддалене керування комп'ютером через мережу."
        ]
    },
    {
        "id": 52,
        "question": "Алгоритм шифрування - це",
        "options": [
            "це алгоритм, згідно з яким здійснюється спеціальне криптографічне перетворення інформації",
            "Зворотній процес до шифрування",
            "Процес криптографічного перетворення даних, за допомогою якого відритий текст перетворюється на шифорваний з метою захисту від несанкціонованого доступу"
        ],
        "correctAnswers": [
            "це алгоритм, згідно з яким здійснюється спеціальне криптографічне перетворення інформації"
        ]
    },
    {
        "id": 53,
        "question": "Відповідно до стандарту TCSEC до безпечної системи ставляться такі вимоги:",
        "options": [
            "кожен користувач системи може надавати доступ до об'єктів системи",
            "безпечна система здатна розрізняти користувачів",
            "система підтримус розмежування доступу субєктів до об'єктів",
            "кожен процес у системі здатний розрізняти користувачів",
            "до об'єктів системи можна застосовувати дії читання, записування, створення і видалення"
        ],
        "correctAnswers": [
            "безпечна система здатна розрізняти користувачів",
            "система підтримус розмежування доступу суб'єктів до об'єктів",
            "кожен процес у системі здатний розрізняти користувачів",
            "до об'єктів системи можна застосовувати дії читання, записування, створення і видалення"
        ]
    },
    {
        "id": 54,
        "question": "Якщо на небезпеку наражаються самі канали або пакети даних, переданих по каналу і вплив на пакети даних може розглядатися як атака на об’єкти мережі: вплив на канали - як специфічний тип атак, характерний для певної мережі, то це є загроза:",
        "options": [
            "інформаційній системі в цілому",
            "суб'єктам інформаційної системи",
            "каналам передачі даних",
            "об'єктам інформаційної системи"
        ],
        "correctAnswers": [
            "каналам передачі даних"
        ]
    },
    {
        "id": 55,
        "question": "Які основні напрями інформаційної діяльності?",
        "options": [
            "духовний, науково-технічний, спортивний, біологічний",
            "міжнародний, соціальний, політичний, духовний",
            "політичний, економічний, комп'ютерний, екологічний",
            "екологічний, економічний, міжнародний, суспільний"
        ],
        "correctAnswers": [
            "міжнародний, соціальний, політичний, духовний"
        ]
    },
    {
        "id": 56,
        "question": "Відповідно до ”Зводу відомостей, що становлять державну таємницю\" є такі ступені секретності:",
        "options": [
            "важливо",
            "особливої важливості",
            "таємно",
            "цілком таємно"
        ],
        "correctAnswers": [
            "особливої важливості",
            "таємно",
            "цілком таємно"
        ]
    },
    {
        "id": 57,
        "question": "На скільки груп розбиті регулятори безпеки в першій частині стандарту ISO/IEC 17799?",
        "options": [
            "На 9 груп",
            "На 6 груп",
            "На 10 груп",
            "На 8 груп",
            "На 5 груп"
        ],
        "correctAnswers": [
            "На 6 груп"
        ]
    },
    {
        "id": 58,
        "question": "Система ТЗІ - це",
        "options": [
            "сукупність суб’єктів, об'єднаних цілями та завданнями захисту інформації інженерно-технічними заходами, нормативно-правова та матеріально-технічна база",
            "сукупність об'єктів, об'єднаних цілями та завданнями захисту інформації інженерно-технічними заходами, нормативно-правова база"
        ],
        "correctAnswers": [
            "сукупність суб’єктів, об'єднаних цілями та завданнями захисту інформації інженерно-технічними заходами, нормативно-правова та матеріально-технічна база"
        ]
    },
    {
        "id": 59,
        "question": "Таємна інформація - це",
        "options": [
            "відображена та задокументована будь-якими засобами та на будь-яких носіях інформації, що була отримана або створена в процесі виконання суб'єктами владних повноважень своїх обов'язків, передбачених чинним законодавством, або яка знаходиться у володінні суб'єктів владних повноважень, інших розпорядників публічної інформації, визначених Законом Про доступ до публічної інформації",
            "інформація, доступ до якої обмежено фізичною або юридичною особою, крім суб'єктів владних повноважень, та яка може поширюватися у визначеному ними порядку за їхнім бажанням відповідно до передбачених ними умов",
            "інформація, доступ до якої обмежується відповідно до частини другої статті б Закону Про доступ до публічної інформації, розголошення якої може завдати шкоди особі, суспільству і державі",
            "інформація, яка зібрана в процесі оперативно-розшукової, контррозвідувальної діяльності, у сфері оборони країни, яку не віднесено до державної таємниці"
        ],
        "correctAnswers": [
            "інформація, доступ до якої обмежується відповідно до частини другої статті б Закону Про доступ до публічної інформації, розголошення якої може завдати шкоди особі, суспільству і державі"
        ]
    },
    {
        "id": 60,
        "question": "Несприятливий вплив це:",
        "options": [
            "вплив, що призводить до зменшення цінності інформаційних ресурсів а також можуть спричинити порушення політики безпеки інформації",
            "вплив, що призводить до зменшення цінності інформаційних ресурсів.",
            "будь-які обставини чи події, що можуть спричинити порушення політики безпеки інформації та (або) нанесення збитку ІКС."
        ],
        "correctAnswers": [
            "вплив, що призводить до зменшення цінності інформаційних ресурсів."
        ]
    },
    {
        "id": 61,
        "question": "ідентифікація це:",
        "options": [
            "це процедура надання користувачу визначених повноважень у системі.",
            "процес роз-пізнавання об'єктів системи за їхніми мітками, або ідентифікаторами.",
            "перевірка запропонованого ідентифікатора на відповідність об'єкту, пересвідчення в його справжності."
        ],
        "correctAnswers": [
            "процес роз-пізнавання об'єктів системи за їхніми мітками, або ідентифікаторами."
        ]
    },
    {
        "id": 62,
        "question": "На етапі введення КСЗІ вдію проводять:",
        "options": [
            "пусконалагоджувальні роботи",
            "комплектування КСЗІ",
            "підготовку КСЗІ",
            "дослідну експлуатацію",
            "попередні випробування",
            "будівельно-монтажні роботи",
            "підготовка ТЗІ",
            "державну експертизу КСЗІ",
            "навчання користувачів"
        ],
        "correctAnswers": [
            "пусконалагоджувальні роботи",
            "комплектування КСЗІ",
            "підготовку КСЗІ",
            "дослідну експлуатацію",
            "попередні випробування",
            "будівельно-монтажні роботи",
            "державну експертизу КСЗІ",
            "навчання користувачів"
        ]
    },
    {
        "id": 63,
        "question": "Технічна оснащеність порушника:",
        "options": [
            "програмні засоби",
            "комунікативні засоби",
            "апаратні засоби",
            "спеціальні засоби",
            "технічні засоби"
        ],
        "correctAnswers": [
            "програмні засоби",
            "апаратні засоби",
            "спеціальні засоби"
        ]
    },
    {
        "id": 64,
        "question": "До недоліків стандарту TCSEC можна віднести:",
        "options": [
            "основні вимоги не враховують властивість цілісності інформації",
            "стандарт не дає змоги оцінити загальну захищеність системи",
            "основні вимоги спрямовані на мітки конфіденційності",
            "основні вимоги не враховують властивість доступності інформації"
        ],
        "correctAnswers": [
            "основні вимоги не враховують властивість цілісності інформації",
            "основні вимоги не враховують властивість доступності інформації"
        ]
    },
    {
        "id": 65,
        "question": "Згідно з Законом України Про захист інформації в автоматизованих системах під втратою інформації розуміють",
        "options": [
            "навмисні дії, що призводять до перекручення інформації, яка повинна оброблятися або зберігатися в АС",
            "дію. внаслідок якої інформація в АС перестає існувати для фізичних або юридичних осіб, які мають право власності на неї в повному чи обмеженому обсязі",
            "дії, наслідком яких є припинення доступу до інформації",
            "дії або обставини, які призводять до спотворення процесу обробки інформації"
        ],
        "correctAnswers": [
            "дію. внаслідок якої інформація в АС перестає існувати для фізичних або юридичних осіб, які мають право власності на неї в повному чи обмеженому обсязі"
        ]
    },
    {
        "id": 66,
        "question": "В основу політики безпеки покладено такі принципи:",
        "options": [
            "реалізація заходів захисту інформації є рентабельною",
            "неперервність захисту",
            "системність",
            "достатність механізмів і заходів захисту, адекватна загрозам",
            "у будь-якому середовищі функціонування АС забезпечено можливість оцінювання і перевірки захищеності інформації",
            "комплексність"
        ],
        "correctAnswers": [
            "неперервність захисту",
            "системність",
            "достатність механізмів і заходів захисту, адекватна загрозам",
            "комплексність"
        ]
    },
    {
        "id": 67,
        "question": "Розглядаючи різні варіанти реалізації технічного рівня забезпечення безпеки інформації, слід враховувати такі аспекти",
        "options": [
            "інженерно-технічне обладнання приміщень, в яких розміщуються компоненти АС, експлуатація та супроводження засобів блокування технічних каналів витоку інформації",
            "системи нормативно-правового забезпечення робіт із захисту інформації в АС (організації*)",
            "процедури доведення до персоналу і користувачів АС основних положень політики безпеки інформації, їхнього навчання і підвищення кваліфікації з питань безпеки інформації",
            "реєстрація санкціонованих користувачів АС, авторизація користувачів у системі",
            "керування доступом до інформації та механізмів, що реалізують послуги безпеки (вимоги до розподілу ролей користувачів і адміністраторів)"
        ],
        "correctAnswers": [
            "інженерно-технічне обладнання приміщень, в яких розміщуються компоненти АС, експлуатація та супроводження засобів блокування технічних каналів витоку інформації",
            "реєстрація санкціонованих користувачів АС, авторизація користувачів у системі",
            "керування доступом до інформації та механізмів, що реалізують послуги безпеки (вимоги до розподілу ролей користувачів і адміністраторів)"
        ]
    },
    {
        "id": 68,
        "question": "Повноваження порушника в АС:",
        "options": [
            "отримання необхідної інформації",
            "отримання можливості вносити зміни в інформаційні потоки відповідно до своїх намірів",
            "керування функціонуванням і внесення змін у конфігурацію системи",
            "підключення чи змінення конфігурації апаратних засобів",
            "запуск фіксованого набору задач (програм)",
            "створення і запуск власних програмних засобів",
            "завдання збитків шляхом знищення матеріальних та інформаційних цінностей"
        ],
        "correctAnswers": [
            "керування функціонуванням і внесення змін у конфігурацію системи",
            "підключення чи змінення конфігурації апаратних засобів",
            "запуск фіксованого набору задач (програм)",
            "створення і запуск власних програмних засобів"
        ]
    },
    {
        "id": 69,
        "question": "У будь-якій захищеній системі передбачені засоби, які використовують за надзвичайних ситуацій, або засоби, які спроможні функціонувати навіть у разі порушення правил запровадженої політики безпеки. Наприклад, у разі несподіваної перевірки роботи системи користувач повинен мати доступ до всіх наборів системи. Звичайно, ці засоби використовуються адміністраторами, операторами, системними програмістами й іншими користувачами, що виконують спеціальні функції. Якщо ці засоби використовуються не за призначенням, то це:",
        "options": [
            "доступність компонента(ресурсу)",
            "цілісність компонента(ресурсу)",
            "безпека інформаційної системи",
            "незаконне використання привілеїв"
        ],
        "correctAnswers": [
            "незаконне використання привілеїв"
        ]
    },
    {
        "id": 70,
        "question": "Відповідальність за забезпечення захисту інформації в системі покладається на",
        "options": [
            "користувача",
            "власника системи",
            "законодавство",
            "власника інформації"
        ],
        "correctAnswers": [
            "власника системи"
        ]
    },
    {
        "id": 71,
        "question": "Який стандарт розроблений таким чином, щоб задовольнити потреби трьох груп фахівців: розробників, експертів з сертифікації та користувачів продуктів інформаційних технологій?",
        "options": [
            "ISO/IEC 27001",
            "ISO/IEC 27002",
            "ISO/IEC 27005",
            "ISO 15408",
            "ISO/IEC 17799"
        ],
        "correctAnswers": [
            "ISO 15408"
        ]
    },
    {
        "id": 72,
        "question": "До заходів захисту насамперед належать:",
        "options": [
            "Проектування ІКС з урахуванням вимог цієї політики",
            "Протидія прослуховуванню трафіку",
            "Трансляція мережних адрес",
            "Розроблення політики безпеки інформації в системі"
        ],
        "correctAnswers": [
            "Проектування ІКС з урахуванням вимог цієї політики",
            "Розроблення політики безпеки інформації в системі"
        ]
    },
    {
        "id": 73,
        "question": "Право на доступ до публічної інформації гарантується",
        "options": [
            "обов'язком розпорядників інформації надавати та оприлюднювати інформацію, крім випадків, передбачених законом",
            "обов'язком суб'єктів владних повноважень інформувати громадськість та засоби масової інформації про свою діяльність і прийняті рішення",
            "створенням механізму реалізації права на інформацію",
            "здійсненням державного і громадського контролю за додержанням законодавства про інформацію"
        ],
        "correctAnswers": [
            "обов'язком розпорядників інформації надавати та оприлюднювати інформацію, крім випадків, передбачених законом"
        ]
    },
    {
        "id": 74,
        "question": "Який із наведених етапів не входить в процес управління інформаційною безпекою?",
        "options": [
            "збір та аналіз даних про стан інформаційної безпеки",
            "усвідомлення необхідності захисту інформації",
            "оцінка ризиків",
            "моніторинг функціонування механізмів контролю",
            "навчання і мотивація персоналу",
            "розробка механізмів захисту"
        ],
        "correctAnswers": [
            "усвідомлення необхідності захисту інформації"
        ]
    },
    {
        "id": 75,
        "question": "Які дані відносять до інформації про довкілля?",
        "options": [
            "дані про стан здоров'я та безпеки людей, умови життя людей, стан об'єктів культури і споруд тією мірою, якою на них впливає або може вплинути стан складових довкілля",
            "відомості про ставлення до окремих осіб, подій, явищ, процесів, фактів тощо",
            "відомості про право, його систему, джерела, реалізацію, юридичні факти, правовідносини, правопорядок, правопорушення",
            "дані, що дають кількісну характеристику масових явищ та процесів, які відбуваються в економічній, соціальній, культурній та інших сферах життя суспільства"
        ],
        "correctAnswers": [
            "дані про стан здоров'я та безпеки людей, умови життя людей, стан об'єктів культури і споруд тією мірою, якою на них впливає або може вплинути стан складових довкілля"
        ]
    },
    {
        "id": 76,
        "question": "Ким здійснюється віднесення інформації до державної таємниці",
        "options": [
            "державним експертом",
            "Кабінетом Міністрів",
            "Верховною Радою",
            "президентом країни"
        ],
        "correctAnswers": [
            "державним експертом"
        ]
    },
    {
        "id": 77,
        "question": "Вихідними даними для політики безпеки АС є такі:",
        "options": [
            "модель загроз і модель порушників",
            "результати аналізу середовищ функціонування",
            "результати аналізу ризиків",
            "результати функціонування ризиків",
            "завдання і функції системи"
        ],
        "correctAnswers": [
            "модель загроз і модель порушників",
            "результати аналізу середовищ функціонування",
            "результати аналізу ризиків",
            "завдання і функції системи"
        ]
    },
    {
        "id": 78,
        "question": "Сертифікація ISO/IEC 27001 в організації дозволяє отримати наступні переваги:",
        "options": [
            "Підвищити довіри до організації з боку контрагентів;",
            "Ефективний маркетинг безпеки для всіх адміністраторів і службовців;",
            "Спростити процедуру виходу на зовнішні ринки;",
            "Систематизувати процеси забезпечення інформаційної безпеки;"
        ],
        "correctAnswers": [
            "Підвищити довіри до організації з боку контрагентів;",
            "Спростити процедуру виходу на зовнішні ринки;",
            "Систематизувати процеси забезпечення інформаційної безпеки;"
        ]
    }
];