export const questionsCryptoLaw = [
    {
        id: 1,
        question: 'Які параметри обираються в алгоритмі RSA?',
        options: [
            'Усі варіанти правильні',
            'Два великих простих числа, ключ зашифрування',
            'Ключ зашифрування і розшифрування',
            'Функція Ейлера, ключ розшифрування'
        ],
        correctAnswers: [
            'Два великих простих числа, ключ зашифрування',
        ]
    },
    {
        id: 2,
        question: 'Відзначте елементи криптосистеми.',
        options: [
            'Систему управління ключами',
            'Антивірусне ПЗ',
            'Алгоритм шифрування та набір ключів, використовуваних для шифрування',
            'Міжмережевий екран'
        ],
        correctAnswers: [
            'Алгоритм шифрування та набір ключів, використовуваних для шифрування'
        ]
    },
    {
        id: 3,
        question: 'До якої категорії належить шифр Цезаря? Шифр Цезаря відноситься до...',
        options: [
            'Використовує свій унікальний шифр для підстановки',
            'Моноалфавітних шифрів підстановки',
            'Одноалфавітних шифрів підстановки',
            'Поліалфавітних шифрів підстановки'
        ],
        correctAnswers: [
            'Моноалфавітних шифрів підстановки'
        ]
    },
    {
        id: 4,
        question: 'До якої категорії належить шифр Цезаря? Шифр Цезаря відноситься до...',
        options: [
            'Використовує свій унікальний шифр для підстановки',
            'Моноалфавітних шифрів підстановки',
            'Одноалфавітних шифрів підстановки',
            'Поліалфавітних шифрів підстановки'
        ],
        correctAnswers: [
            'Моноалфавітних шифрів підстановки'
        ]
    },
    {
        id: 5,
        question: 'Криптографічне перетворення інформації - це',
        options: [
            'перетворення інформації з метою забезпечення відкритості або відновлення її змісту, підтвердження її справжності, цілісності, авторства, захисту від несанкціонованого доступу до інформації та ресурсів тощо, яке здійснюється з використанням спеціальних даних (ключів).',
            'перетворення інформації з метою приховування або відновлення її змісту, підтвердження її справжності, цілісності, авторства, захисту від несанкціонованого доступу до інформації та ресурсів тощо, яке здійснюється з використанням спеціальних біометричних даних.',
            'перетворення інформації з метою приховування або відновлення її змісту, підтвердження її справжності, цілісності, авторства, захисту від несанкціонованого доступу до користувача та ресурсів тощо, яке здійснюється з використанням спеціальних даних (ключів).',
            'перетворення інформації з метою приховування або відновлення її змісту, підтвердження її справжності, цілісності, авторства, захисту від несанкціонованого доступу до інформації та ресурсів тощо, яке здійснюється з використанням спеціальних даних (ключів).',
        ],
        correctAnswers: [
            'перетворення інформації з метою приховування або відновлення її змісту, підтвердження її справжності, цілісності, авторства, захисту від несанкціонованого доступу до інформації та ресурсів тощо, яке здійснюється з використанням спеціальних даних (ключів).'
        ]
    },
    {
        id: 6,
        question: 'Відзначте повідомлення «Шифр Цезаря» зашифроване шифром Цезаря з ключем k = 3?',
        options: [
            '«ЮйчуЩзїгув»',
            '«ЯкшфЯїлецд»',
            'Жодний з цих варіантів',
            '«ЬїцтЮжівтб»'
        ],
        correctAnswers: [
            '«ЮйчуЩзїгув»'
        ]
    },
    {
        id: 7,
        question: 'Відносно невелика кількість додаткової аутентификуючої інформації, переданої разом з підписується текстом, називається ...',
        options: [
            'Вірусна маска',
            'Електронний цифровий підпис',
            'Відкритий ключ шифрування',
            'Закритий ключ шифрування'
        ],
        correctAnswers: [
            'Електронний цифровий підпис'
        ]
    },
    {
        id: 8,
        question: 'Для чого використовується цифровий підпис?',
        options: [
            'Забезпечення аутентифікації',
            'Забезпечення конфіденційності',
            'Забезпечення цілісності',
            'Забезпечення цілісності і аутентифікації'
        ],
        correctAnswers: [
            'Забезпечення цілісності і аутентифікації'
        ]
    },
    {
        id: 9,
        question: 'Який розмір ключа шифру DES?',
        options: [
            '16біт',
            '128біт',
            '56біт',
            '32біт'
        ],
        correctAnswers: [
            '56біт'
        ]
    },
    {
        id: 10,
        question: 'Хеш-функція використовується для:',
        options: [
            'Обміну секретними ключами',
            'Контролю цілісності даних',
            'Аутентифікації джерела повідомлення',
            'Передачі повідомлення по захищеному каналу'
        ],
        correctAnswers: [
            'Контролю цілісності даних',
            'Аутентифікації джерела повідомлення'
        ]
    },
    {
        id: 11,
        question: 'Конфіденційність - це',
        options: [
            'захист з незаданою якістю (імовірністю) від несанкціонованого доступу до інформації та спроб розкриття (ознайомлення зі змістом) неавторизованими користувачами і (або) процесами',
            'захист з наперед заданим протоколом (імовірністю) від несанкціонованого доступу до інформації та спроб розкриття (ознайомлення зі змістом) неавторизованими користувачами і (або) процесами',
            'захист з наперед заданою якістю (імовірністю) від несанкціонованого доступу до інформації та спроб розкриття (ознайомлення зі змістом) авторизованими користувачами і (або) процесами',
            'захист з наперед заданою якістю (імовірністю) від несанкціонованого доступу до інформації та спроб розкриття (ознайомлення зі змістом) неавторизованими користувачами і (або) процесами'
        ],
        correctAnswers: [
            'захист з наперед заданою якістю (імовірністю) від несанкціонованого доступу до інформації та спроб розкриття (ознайомлення зі змістом) неавторизованими користувачами і (або) процесами'
        ]
    },
    {
        id: 12,
        question: 'Як називається стійкість шифру до дешифрування без знання ключа?',
        options: [
            'Пароль',
            'Криптостійкість',
            'Аудентіфікатор',
            'Шифратор'
        ],
        correctAnswers: [
            'Криптостійкість'
        ]
    },
    {
        id: 13,
        question: 'Накладання електронного цифрового підпису це:',
        options: [
            'операція, яка здійснюється відправником документу із використанням його таємного ключа',
            'операція, яка здійснюється отримувачем документу із використанням його таємного- ключа',
            'операція, яка здійснюється отримувачем документу із використанням його відкритого ключа',
            'операція, яка здійснюється відправником документу із використанням його відкритого ключа'
        ],
        correctAnswers: [
            'операція, яка здійснюється відправником документу із використанням його відкритого ключа'
        ]
    },
    {
        id: 14,
        question: 'Дешифрування - це',
        options: [
            'зворотній до шифрування процес, при якому шифротекст перетворюється у відкритий текст з використанням секретного ключа.',
            'зворотній до шифрування процес, при якому шифротекст перетворюється у відкритий текст без використанням секретного ключа.',
            'зворотній до шифрування процес, при якому шифротекст перетворюється у відкритий текст з використанням відкритого ключа',
            'зворотній до шифрування процес, при якому шифротекст перетворюється у закритий текст з використанням секретного ключа.'
        ],
        correctAnswers: [
            'зворотній до шифрування процес, при якому шифротекст перетворюється у відкритий текст з використанням секретного ключа.'
        ]
    },
    {
        id: 15,
        question: 'До недоліків цифрового підпису належить:',
        options: [
            'Неможливість підписати довгі повідомлення без розбиття на блоки',
            'Можливість найпростішої атаки шляхом перестановки блоків;',
            'Повільна швидкодія',
            'Всі відповіді правильні'
        ],
        correctAnswers: [
            'Всі відповіді правильні'
        ]
    },
    {
        id: 16,
        question: 'У протоколі Діффі-Хелмана, щоб користувач А пересилав секретне повідомлення до користувача Б. він зашифровує повідомлення використовуючи:',
        options: [
            'Секретний ключ користувача А',
            'Секретний ключ користувача Б',
            'Відкритий ключ користувача А',
            'цей протокол не використовується для шифрування'
        ],
        correctAnswers: [
            'цей протокол не використовується для шифрування'
        ]
    },
    {
        id: 17,
        question: 'Якщо користувач криптосистеми RSA вибрав для генерації модуля n два числа р та q, і отримав число n= 2627, при чому q=71, тоді р дорівнює:',
        options: [
            '72',
            '12',
            '37',
            '27'
        ],
        correctAnswers: [
            '37'
        ]
    },
    {
        id: 18,
        question: 'Чому криптосистему Ель-Гамаля можна віднести до схеми ймовірнісного шифрування?',
        options: [
            'Через використання відкритих і секретних ключів',
            'Через уведення у процес шифрування рандомізатора',
            'Через подвоєння довжини шифротексту порівняно з довжиною відкритого тексту',
            'Через складність задачі дискретного логарифмування, покладеної в основу криптосистеми'
        ],
        correctAnswers: [
            'Через уведення у процес шифрування рандомізатора'
        ]
    },
    {
        id: 19,
        question: 'Прикладом абсолютно стійкої криптосистеми є',
        options: [
            'Вернама',
            'Афінної підстановки',
            'Фейстеля',
            'Віженера',
            'Цезаря'
        ],
        correctAnswers: [
            'Вернама'
        ]
    },
    {
        id: 20,
        question: 'Які є види Хеш-функцїі?',
        options: [
            'Ключова',
            'Одностороння',
            'Безключова',
            'Одностороння з секретом'
        ],
        correctAnswers: [
            'Одностороння'
        ]
    },
    {
        id: 21,
        question: 'Якщо користувач криптосистеми RSA вибрав для генерації модуля n два числа р=7 та q=13, то який відкритий ключ він може вибрати серед чисел:',
        options: [
            '32',
            '13',
            '149',
            '91'
        ],
        correctAnswers: [
            '13'
        ]
    },
    {
        id: 22,
        question: 'Відзначте твердження, що стосуються симетричного методу шифрування.',
        options: [
            'Для формування відкритих ключів призначені Центри сертифікації ключів',
            'Метод шифрування передбачає використання в парі два різних ключі - відкритий і секретний.',
            'DES (Data Encryption Standard), 3-DES, RC2, RC4, AES (Advanced Encryption Standard).',
            'Обидві сторони-учасники обміну даними мають абсолютно однакові ключі для шифрування і розшифровки даних.'
        ],
        correctAnswers: [
            'Метод шифрування передбачає використання в парі два різних ключі - відкритий і секретний.',
            'DES (Data Encryption Standard), 3-DES, RC2, RC4, AES (Advanced Encryption Standard).'
        ]
    },
    {
        id: 23,
        question: "Асиметрична криптографія розв'язала наступні проблеми симетричної криптографії:",
        options: [
            'Проблему програмної реалізації шифрів',
            'Проблему поширення секретних ключів',
            'Проблему апаратної реалізації шифрів',
            'Проблему безпеки шифрування',
            'Проблему швидкості передачі даних'
        ],
        correctAnswers: [
            'Проблему поширення секретних ключів'
        ]
    },
    {
        id: 24,
        question: 'У системі шифрування Ель - Гамаля накладається обмеження на розмір повідомлення.',
        options: [
            'М>р',
            'М=р',
            'всі відповіді неправильні',
            'М'
        ],
        correctAnswers: [
            'всі відповіді неправильні'
        ]
    },
    {
        id: 25,
        question: 'Який розмір блоку має криптографічний шифр DES?',
        options: [
            '4 біт',
            '16 біт',
            '64 біт',
            'Жодна з цих відповідей',
            '56 біт'
        ],
        correctAnswers: [
            '64 біт'
        ]
    },
    {
        id: 26,
        question: 'Як називають в криптографії змінний елемент шифру, який застосовується для шифрування конкретного повідомлення?',
        options: [
            'розрядність блоку',
            'алгоритм шифрування',
            'ключ',
            'число раундів шифрування'
        ],
        correctAnswers: [
            'ключ'
        ]
    },
    {
        id: 27,
        question: 'Стійкість системи RSA базується на складності обчислення',
        options: [
            'Задачі факторизації',
            'Дискретного логарифму',
            'Дискретного алгоритму',
            "Дискретного розкладу Фур'є"
        ],
        correctAnswers: [
            'Задачі факторизації'
        ]
    },
    {
        id: 28,
        question: 'Криптосистема включає ...',
        options: [
            'Алгоритм шифрування та набір ключів, використовуваних для шифрування',
            'Міжмережевий екран',
            'Систему управління ключами',
            'Антивірусне ПЗ'
        ],
        correctAnswers: [
            'Алгоритм шифрування та набір ключів, використовуваних для шифрування'
        ]
    },
    {
        id: 29,
        question: 'Стійкість системи Діффі-Хелмана базується на складності обчислення',
        options: [
            'Обчисленні символу Лежандра',
            'Факторизації великих чисел',
            'Складності задачі обчислення дискретного логарифму (logmod)',
            'Операції піднесення до степеня'
        ],
        correctAnswers: [
            'Складності задачі обчислення дискретного логарифму (logmod)'
        ]
    },
    {
        id: 30,
        question: 'Шифрування - це',
        options: [
            'процес криптографічного перетворення, при якому відкритий текст замінюється шифротекстом з допомогою відкритого або секретного ключа',
            'процес криптографічного перетворення, при якому відкритий текст замінюється шифротекстом з допомогою тільки відкритого ключа',
            'процес криптографічного перетворення, при якому відкритий текст замінюється шифротекстом з допомогою тільки секретного ключа',
            'процес криптографічного перетворення, при якому закритий текст замінюється шифротекстом з допомогою відкритого або секретного ключа'
        ],
        correctAnswers: [
            'процес криптографічного перетворення, при якому відкритий текст замінюється шифротекстом з допомогою відкритого або секретного ключа'
        ]
    },
    {
        id: 31,
        question: 'Алгоритм Ель-Гамаля можна використовувати:',
        options: [
            'для шифрування повідомлень і генерування секретного ключа',
            'для генерування секретного ключа',
            'усі варіанти правильні',
            'для шифрування повідомлень та створювання цифрового підпису'
        ],
        correctAnswers: [
            'для шифрування повідомлень та створювання цифрового підпису'
        ]
    },
    {
        id: 32,
        question: 'Криптопротокол Ель-Гамаля передбачає, що після отримання ШТ від користувача А, користувач б розшифровує його використовуючи:',
        options: [
            'Відкритий ключ користувача Б',
            'Секретний ключ користувача Б',
            'Відкритий ключ користувача А',
            'Секретний ключ користувача А'
        ],
        correctAnswers: [
            'Секретний ключ користувача Б'
        ]
    },
    {
        id: 33,
        question: "В яких сферах застосовується криптографія?",
        options: [
            "хешування паролів: безпечні транзакціі платіжною карткою в Інтернет.",
            "Харчування: Проектування макетів.",
            "Будівництво; Малювання.",
            "Мобільний трафік: GSM; Моделювання."
        ],
        correctAnswers: [
            "хешування паролів: безпечні транзакціі платіжною карткою в Інтернет."
        ]
    },
    {
        id: 34,
        question: "Шифр, який являє собою послідовність (з можливим повторенням і чергуванням) основних методів криптографічного перетворення, що застосовується до частини шифрованого тексту, називається",
        options: [
            "Блоковим",
            "гамування",
            "розсічення-рознесення",
            "підстановки"
        ],
        correctAnswers: [
            "Блоковим"
        ]
    },
    {
        id: 35,
        question: "Скільки циклів перетворення в ГОСТ 28147-89?",
        options: [
            "64",
            "34",
            "32",
            "62"
        ],
        correctAnswers: [
            "32"
        ]
    },
    {
        id: 36,
        question: "Чи належить шифр Цезаря до крипто стійких шифрів?",
        options: [
            "Так. але шифр можна зламати при використанні суперкомп'ютера",
            "Так. шифр є надійним і є незламним",
            "Жодний з цих варіантів",
            "Ні, шифр можна зламати простим перебором ключів"
        ],
        correctAnswers: [
            "Ні, шифр можна зламати простим перебором ключів"
        ]
    },
    {
        id: 37,
        question: "Скільки Існує DES-слабких ключів? Скільки існує слабких ключів у стандарті DES?",
        options: [
            "256",
            "4096",
            "4",
            "Не існує DES-слабких ключів"
        ],
        correctAnswers: [
            "4"
        ]
    },
    {
        id: 38,
        question: "Чим відрізняються синхронні потокові шифри від блокових шифрів?",
        options: [
            "шифрограма є результат накладення послідовності тексту і послідовності гами, що залежить від вхідної послідовності",
            "доповнюється хеш-функцією",
            "обмислюється ЕЦП",
            "шифрограма є результат накладення послідовності тексту і послідовності працюючого генератора гамма"
        ],
        correctAnswers: [
            "шифрограма є результат накладення послідовності тексту і послідовності працюючого генератора гамма"
        ]
    },
    {
        id: 39,
        question: "Що відносить шифр Ель-Гамалля до ймовірнісного",
        options: [
            "Обмеження за розміром повідомлення",
            "Використання примітивного елемента",
            "Використання випадкового r (рандомізація)",
            "Всі відповіді правильні"
        ],
        correctAnswers: [
            "Використання випадкового r (рандомізація)"
        ]
    },
    {
        id: 40,
        question: "Криптографічна хеш-функція повинна забезпечувати:",
        options: [
            "Безпечний обмін повідомленнями по каналу передачі даних",
            "Необоротність",
            "Всі відповіді правильні",
            "Стійкість до колізій"
        ],
        correctAnswers: [
            "Необоротність",
            "Стійкість до колізій"
        ]
    },
    {
        id: 41,
        question: "Захист інформації - це",
        options: [
            "сукупність правил і рекомендацій, що забезпечують цілісність, конфіденційність та доступність інформації ресурсів в КСЗІ IT за умов впливу на неї загроз природного або штучного характеру, реалізація яких може призвести до завдання шкоди власникам і користувачам інформації.",
            "Сукупність методів і засобів, що забезпечують цілісність, конфіденційність та доступність інформації про користувача в КСЗІ IT за умов впливу на неї загроз природного або штучного характеру, реалізація яких може призвести до завдання шкоди власникам і користувачам інформації",
            "Сукупність методів і засобів, що забезпечують цілісність, конфіденційність та доступність інформації ресурсів в КСЗІ IT за умов впливу на неї загроз природного або штучного характеру, реалізація яких може призвести до завдання шкоди власникам і користувачам інформації.",
            "Сукупність методів і засобів, що забезпечують цілісність, конфіденційність та доступність інформації ресурсів в КСЗІ IT за умов впливу на неї загроз фізичного або морального характеру, реалізація яких може призвести до завдання шкоди власникам і користувачам інформації."
        ],
        correctAnswers: [
            "Сукупність методів і засобів, що забезпечують цілісність, конфіденційність та доступність інформації ресурсів в КСЗІ IT за умов впливу на неї загроз природного або штучного характеру, реалізація яких може призвести до завдання шкоди власникам і користувачам інформації."
        ]
    },
    {
        id: 42,
        question: "Спостережуваність - це",
        options: [
            "забезпечення можливості відслідковування всіх спроб злому інформації реєстрації роботи та дій користувачів та процесів, використання ресурсу системи, без встановлення ідентифікаторів (імен), причетних до певних подій користувачів та процесів, а також реакції на ці подп з метою мінімізації можливих втрат в системі",
            "забезпечення можливості відслідковування всіх спроб злому інформації, реєстрації роботи та дій користувачів та процесів, використання ресурсу системи, однозначного встановлення ідентифікаторів (імен), причетних до певних подій користувачів та процесів, а також реакції на ці події з метою мінімізації можливих втрат в системі",
            "забезпечення можливості відслідковування всіх спроб злому інформації, реєстрації роботи та дій користувачів та процесів, використання ресурсу системи, однозначного встановлення ідентифікаторів (імен), причетних до певних подій користувачів та процесів, а також реакції на ці події з метою максимізації можливих втрат в системі",
            "забезпечення можливості відслідковування всіх спроб фізичного злому ПК, реєстрації роботи та дій користувачів та процесів, використання ресурсу системи, однозначного встановлення ідентифікаторів (імен), причетних до певних подій користувачів та процесів, а також реакції на ці події з метою мінімізації можливих втрат в системі"
        ],
        correctAnswers: [
            "забезпечення можливості відслідковування всіх спроб злому інформації, реєстрації роботи та дій користувачів та процесів, використання ресурсу системи, однозначного встановлення ідентифікаторів (імен), причетних до певних подій користувачів та процесів, а також реакції на ці події з метою мінімізації можливих втрат в системі"
        ]
    },
    {
        id: 43,
        question: "Доступність - це",
        options: [
            "захист (забезпечення) доступу до інформації авторизованими користувачами і (або) процесом, який не наділений відповідними повноваженнями, та можливості її використання згідно з правилами та з визначеною якістю. Доступність забезпечується як підтриманням систем в робочому стані так І завдяки способам, які дозволяють швидко відновити втрачену чи пошкоджену інформацію",
            "захист (забезпечення) доступу до Інформації авторизованими користувачами і (або) процесом, який наділений відповідними повноваженнями, та можливості її використання згідно з правилами та з визначеною якістю. Доступність забезпечується як підтриманням систем в робочому стані так і завдяки способам, які дозволяють швидко відновити втрачену чи пошкоджену інформацію",
            "захист (забезпечення) доступу до інформації неавторизованими користувачами і (або) процесом, який наділений відповідними повноваженнями, та можливості її використання згідно з правилами та з визначеною якістю. Доступність забезпечується як підтриманням систем в робочому стані так і завдяки способам, які дозволяють швидко відновити втрачену чи пошкоджену інформацію",
            "захист (забезпечення) доступу до інформації авторизованими користувачами і (або) процесом, який наділений відповідними повноваженнями, та можливості її використання згідно з моральними нормами та з визначеною якістю. Доступність забезпечується як підтриманням систем в робочому стані так і завдяки способам, які дозволяють швидко відновити втрачену чи пошкоджену інформацію"
        ],
        correctAnswers: [
            "захист (забезпечення) доступу до Інформації авторизованими користувачами і (або) процесом, який наділений відповідними повноваженнями, та можливості її використання згідно з правилами та з визначеною якістю. Доступність забезпечується як підтриманням систем в робочому стані так і завдяки способам, які дозволяють швидко відновити втрачену чи пошкоджену інформацію"
        ]
    },
    {
        id: 44,
        question: "Як називається процес, в ході якого зашифрований текст перетворюється у вихідний (незашифрований)?",
        options: [
            "Спотворення",
            "Перетворення",
            "Шифрування",
            "Дешифрування"
        ],
        correctAnswers: [
            "Дешифрування"
        ]
    },
    {
        id: 45,
        question: "Протокол Діффі-Хелмана, що реалізується між користувачами А і Б, призначений для:",
        options: [
            "генерації особистих відкритих ключів користувачів А і Б",
            "генерації спільного секретного ключа для двох користувачів",
            "генерації особистих секретних ключів користувачів А і Б",
            "генерації секретного ключа користувача А і відкритого ключа користувача Б"
        ],
        correctAnswers: [
            "генерації спільного секретного ключа для двох користувачів"
        ]
    },
    {
        id: 46,
        question: "Зашифрувати повідомлення М за допомогою алгоритму RSA, якщо відомо: n=15, е=3, М=3.",
        options: [
            "9",
            "12",
            "20",
            "16"
        ],
        correctAnswers: [
            "12"
        ]
    },
    {
        id: 47,
        question: "При шифруванні у системі RSA повідомлення М спочатку розкладаємо на цифрові блоки, чиї розміри є:",
        options: [
            "Дорівнюють n",
            "Більші за n",
            "менші за n",
            "Правильної відповіді немає"
        ],
        correctAnswers: [
            "менші за n"
        ]
    },
    {
        id: 48,
        question: "Які ключі захисту використовуються для функціонування ЕЦП",
        options: [
            "Таємний та зашифрований",
            "Таємний та відкритий",
            "Немає правильної відповіді",
            "Для функціонування ЕЦП не використовують ключі"
        ],
        correctAnswers: [
            "Таємний та відкритий"
        ]
    },
    {
        id: 49,
        question: "Сучасна криптографія включає в себе чотири основних напрями:",
        options: [
            "1. Несиметричні криптосистеми. 2. Криптосистеми з відкритим ключем. 3. Системи електронного підпису. 4. Управління ключами.",
            "1. Симетричні криптосистеми. 2. Криптосистеми з закритим ключем. 3. Системи електронного підпису. 4. Управління ключами.",
            "1. Симетричні криптосистеми. 2. Криптосистеми з відкритим ключем. 3. Системи електронного підпису. 4. Управління ключами.",
            "1. Симетричні криптосистеми. 2. Криптосистеми з доступом до системи. 3. Системи електронного підпису. 4. Управління ключами."
        ],
        correctAnswers: [
            "1. Симетричні криптосистеми. 2. Криптосистеми з відкритим ключем. 3. Системи електронного підпису. 4. Управління ключами."
        ]
    },
    {
        id: 50,
        question: "Відзначте характеристики системи шифрування RSA",
        options: [
            "Симетричною",
            "З закритим ключем",
            "Асиметричною",
            "З відкритим ключем"
        ],
        correctAnswers: [
            "Асиметричною",
            "З відкритим ключем"
        ]
    },
    {
        id: 51,
        question: "DES - це...",
        options: [
            "асиметричний алгоритм шифрування",
            "симетричний алгоритм шифрування",
            "Жодна з цих відповідей"
        ],
        correctAnswers: [
            "симетричний алгоритм шифрування"
        ]
    },
    {
        id: 52,
        question: "Переваги електронно цифрового підпису:",
        options: [
            "не дає можливості особі, що підписала документ, відмовитись від авторства",
            "Гарантує цілісність підписаного документа",
            "Засвідчує що підписаний документ надходить від особи, що його підписала",
            "Всі відповіді правильні"
        ],
        correctAnswers: [
            "Всі відповіді правильні"
        ]
    },
    {
        id: 53,
        question: "Як обчислюється п у системі шифрування RSA:",
        options: [
            "p*q. де q та р два довільних числа",
            "p*q. де q та р прості числа",
            "(p-1 )*(q-1), де q та р два довільних числа",
            "1-(p*q), де q та р прості числа"
        ],
        correctAnswers: [
            "p*q. де q та р прості числа"
        ]
    },
    {
        id: 54,
        question: "Переможцем конкурсу на новий стандарт AES став шифр:",
        options: [
            "RIJNDAEL",
            "TWOFISH",
            "SERPENT",
            "MARS"
        ],
        correctAnswers: [
            "RIJNDAEL"
        ]
    },
    {
        id: 55,
        question: "Криптологія",
        options: [
            "займається проблемами захисту інформації шляхом її перетворення. Криптологія	поділяється на 2 напрямки - криптографію і криптоаналіз.",
            "займається проблемами захисту інформації шляхом її перетворення. Криптологія	поділяється на 2 напрямки - криптографію і криптобезпека",
            "займається проблемами захисту інформації шляхом її спотворення. Криптологія поділяється на 2 напрямки - криптографію і криптоаналіз.",
            "займається проблемами захисту інформації шляхом її перетворення. Криптологія	поділяється на 2 напрямки - криптографію і криптовалюта."
        ],
        correctAnswers: [
            "займається проблемами захисту інформації шляхом її перетворення. Криптологія	поділяється на 2 напрямки - криптографію і криптоаналіз."
        ]
    },
    {
        id: 56,
        question: "Одним з параметрів схеми Діффі-Хелмана є утворюючий (генеруючий) елемент а. Скільки примітивних елементів існує в полі Z10 (просто функция єйлера)",
        options: [
            "4",
            "10",
            "5",
            "9"
        ],
        correctAnswers: [
            "4"
        ]
    },
    {
        id: 57,
        question: "У шифрі Вернама ключ повинен мати критично важливі властивості:",
        options: [
            "Бути справді випадковим",
            "Застосовуватися тільки один раз",
            "Усі відповіді є правильними",
            "Збігатися за розміром з заданим відкритим текстом"
        ],
        correctAnswers: [
            "Усі відповіді є правильними"
        ]
    },
    {
        id: 58,
        question: "Знайти неповну мастку q від ділення числа а=-8 на b=37",
        options: [
            "1",
            "8",
            "29",
            "-1"
        ],
        correctAnswers: [
            "29"
        ]
    },
    {
        id: 59,
        question: "Яка кількість раундів в алгоритмі DES?",
        options: [
            "16",
            "32",
            "4",
            "8"
        ],
        correctAnswers: [
            "16"
        ]
    },
    {
        id: 60,
        question: "Яка розрядність ключа алгоритму шифрування ГОСТ 28147 - 89 ?",
        options: [
            "128 біт",
            "56 біт",
            "256 біт",
            "64 біт"
        ],
        correctAnswers: [
            "256 біт"
        ]
    },
    {
        id: 61,
        question: "Розшифрувати повідомлення С=200 за допомогою криптосистеми RSA(d=5,n=562)",
        options: [
            "125",
            "444",
            "446",
            "443"
        ],
        correctAnswers: [
            "446"
        ]
    },
    {
        id: 62,
        question: "Як формується результат після операції у S-блоки у шифрі «DES»?",
        options: [
            "Перестановка Р",
            "Циклічна перестановка R",
            "Зсув R",
            "Циклічний зсув R"
        ],
        correctAnswers: [
            "Циклічний зсув R"
        ]
    },
    {
        id: 63,
        question: "Обчислити функцію Ейлера для числа 33",
        options: [
            "10",
            "15",
            "20",
            "33"
        ],
        correctAnswers: [
            "20"
        ]
    },
    {
        id: 64,
        question: "Якщо користувач криптосистеми RSA вибрав для генерації модуля два числа р=11 ,q=47, то як відкриту експоненту серед чисел 12;33;125;517 він може вибрати",
        options: [
            "33",
            "125",
            "513",
            "12"
        ],
        correctAnswers: [
            "33"
        ]
    },
    {
        id: 65,
        question: "Результатом операції -5 mod 6 є",
        options: [
            "3",
            "1",
            "4",
            "2"
        ],
        correctAnswers: [
            "1"
        ]
    },
    {
        id: 66,
        question: "Коди аутентифікації повідомлень (МАС) можуть бути побудовані на основі",
        options: [
            "Асиметричного алгоритму RSA в режимі цифрового підпису",
            "Алгоритмів блочного шифрування, що використовуються в режимі СВС",
            "Алгоритмів блочного шифрування, що використовуються в режимі CFB",
            "Алгоритмів блочного шифрування, що використовуються в режимі ЕСВ"
        ],
        correctAnswers: [
            "Алгоритмів блочного шифрування, що використовуються в режимі СВС",
            "Алгоритмів блочного шифрування, що використовуються в режимі CFB"
        ]
    },
    {
        id: 67,
        question: "Знайти остачу r від ділення числа а=-101 на b=10",
        options: [
            "-10",
            "9",
            "1",
            "-11"
        ],
        correctAnswers: [
            "9"
        ]
    },
    {
        id: 68,
        question: "Множення за модулем n цілих чисел а і b називається:",
        options: [
            "Алгебраїчна операція, результатом якої є решта від множення суми а+b на n",
            "Алгебраїчна операція, результатом якої є решта від ділення добутку а*b на n",
            "Алгебраїчна операція, результатом якої є решта від множення добутку а*b на n",
            "Алгебраїчна операція, результатом якої є решта від ділення добутку а*n на b"
        ],
        correctAnswers: [
            "Алгебраїчна операція, результатом якої є решта від ділення добутку а*b на n"
        ]
    },
    {
        id: 69,
        question: "У випадку, якщо ключ шифру Віженера К складається з одного символу, то одержуємо",
        options: [
            "шифр Цезаря",
            "шифр афінної підстановки",
            "шифр Полібія",
            "поліалфавітний шифр"
        ],
        correctAnswers: [
            "шифр Цезаря"
        ]
    },
    {
        id: 70,
        question: "Обчисліть функцію Ейлера для числа 112:",
        options: [
            "92",
            "29",
            "37",
            "48"
        ],
        correctAnswers: [
            "48"
        ]
    },
    {
        id: 71,
        question: "Результатом операції 16 mod 6 є",
        options: [
            "3",
            "2",
            "1",
            "4"
        ],
        correctAnswers: [
            "4"
        ]
    },
    {
        id: 72,
        question: "Один з відкритих параметрів алгоритму Ель-Гамаля «у» обчислюється на основі",
        options: [
            "Обчислення функції Ейлера",
            "Односторонньої функції, що лежить в основі RSA",
            "Дискретного логарифму в полі простих чисел",
            "Односторонньої функції Діффі-Хелмана"
        ],
        correctAnswers: [
            "Дискретного логарифму в полі простих чисел"
        ]
    },
    {
        id: 73,
        question: "Знайти остачу r від ділення числа а=-8 на b=37",
        options: [
            "-29",
            "-1",
            "29",
            "8"
        ],
        correctAnswers: [
            "29"
        ]
    },
    {
        id: 74,
        question: "Скільки елементів поля Z13 мають обернені за множенням",
        options: [
            "10",
            "12",
            "8",
            "7"
        ],
        correctAnswers: [
            "12"
        ]
    },
    {
        id: 75,
        question: "Структура алгоритму AES дозволяє використовувати шифр з довжинами блоку в межах",
        options: [
            "від 64 до 128 бітів",
            "від 32 до 64 бітів",
            "від 128 до 256 бітів",
            "від 256 до 512 бітів"
        ],
        correctAnswers: [
            "від 128 до 256 бітів"
        ]
    },
    {
        id: 76,
        question: "Оберненим елементом до х=5 в полі Z13 є",
        options: [
            "5",
            "8",
            "6",
            "11"
        ],
        correctAnswers: [
            "5"
        ]
    },
    {
        id: 77,
        question: "Користувач оголосив відкритий ключ в схемі RSA: n=15, е=3. Тоді секретним ключем користувача є:",
        options: [
            "1",
            "2",
            "3",
            "4"
        ],
        correctAnswers: [
            "3"
        ]
    },
    {
        id: 78,
        question: "Ключ в RC4 представляє собою:",
        options: [
            "послідовність довжиною 512 байтів",
            "послідовність байтів від 40 до 2048",
            "Жодна Відповідь не є вірною",
            "послідовність довжиною 64 байти"
        ],
        correctAnswers: [
            "послідовність байтів від 40 до 2048"
        ]
    },
    {
        id: 79,
        question: "Користувачу системи RSA з параметрами n = 33, е = 7 передали зашифроване повідомлення с = 13. Розшифруйте це повідомлення, зламавши алгоритм RSA",
        options: [
            "M-25",
            "М=22",
            "M=17",
            "М=19"
        ],
        correctAnswers: [
            "М=19"
        ]
    },
    {
        id: 80,
        question: "Скільки існує обернених елементів в полі Z26",
        options: [
            "12",
            "7",
            "8",
            "10"
        ],
        correctAnswers: [
            "12"
        ]
    },
    {
        id: 81,
        question: "Алгоритм RSA може використовуватись як:",
        options: [
            "Алгоритм асиметричного шифрування",
            "Алгоритм побудови секретного ключа по відкритих каналах",
            "Алгоритм цифрового підпису",
            "Алгоритм симетричного шифрування"
        ],
        correctAnswers: [
            "Алгоритм асиметричного шифрування",
            "Алгоритм цифрового підпису"
        ]
    },
    {
        id: 82,
        question: "Користувач оголосив відкритий ключ в схемі RSA: п=15, е= 5. Секретним ключем користувача є:",
        options: [
            "4",
            "3",
            "2",
            "5"
        ],
        correctAnswers: [
            "5"
        ]
    },
    {
        id: 83,
        question: "Обчислити функцію Ейлера для числа 112:",
        options: [
            "48",
            "29",
            "37",
            "92"
        ],
        correctAnswers: [
            "48"
        ]
    },
    {
        id: 84,
        question: "Які пари ключів розміщаються в деякому доступному відкритому реєстрі згідно з протоколом Діффі-Хелмана:",
        options: [
            "Секретний ключ користувача Б і А",
            "Відкритий і секретний ключі користувача Б",
            "Відкритий ключ користувача А і Б",
            "Секретний і відкритий ключі користувача А"
        ],
        correctAnswers: [
            "Відкритий ключ користувача А і Б"
        ]
    },
    {
        id: 85,
        question: "Хеш-функція це -",
        options: [
            "Функція призначена для стиснення довільного повідомлення чи набору даних представленого як правило в двійковому алфавіті деяку бітову комбінацію фіксованої довжини",
            "Функція генерації секретних ключів",
            "функція призначена для розшифрування повідомлення",
            "Функція призначена для стиснення довільного повідомлення"
        ],
        correctAnswers: [
            "Функція призначена для стиснення довільного повідомлення чи набору даних представленого як правило в двійковому алфавіті деяку бітову комбінацію фіксованої довжини"
        ]
    },
    {
        id: 86,
        question: "Обчислити функцію Ейлера для числа 79:",
        options: [
            "78",
            "0",
            "1",
            "79"
        ],
        correctAnswers: [
            "78"
        ]
    },
    {
        id: 87,
        question: "Підприємства, установи, організації мають право провадити діяльність, пов'язану з державною таємницею, після надання їм спеціального дозволу:",
        options: [
            "Прокуратурою України",
            "Службою безпеки України",
            "Міністерством оборони України",
            "Державною службою спеціального зв'язку та захисту інформації України"
        ],
        correctAnswers: [
            "Службою безпеки України"
        ]
    },
    {
        id: 88,
        question: "Нормативно-правове забезпечення організації і проведення заходів щодо захисту інформації являє собою сукупність законів, нормативних актів і правил, що регламентують як загальну організацію робіт, так і створення і функціонування конкретних систем захисту інформації.",
        options: [
            "НІ",
            "Так"
        ],
        correctAnswers: [
            "Так"
        ]
    },
    {
        id: 89,
        question: "Втрата інформації це -",
        options: [
            "сукупність усіх даних І програм, використовуваних в АС незалежно від засобу їх фізичного І логічного уявлення.",
            "система, що здійснює автоматизоване опрацювання даних, до складу якої входять технічні засоби опрацювання (засоби обчислювальної техніки і зв'язку), а також методи, процедури і програмне забезпечення.",
            "сукупність організаційно-технічних заходів і правових норм для попередження заподіяння збитку інтересам власника інформації або АС і осіб, що користуються інформацією.",
            "дія, унаслідок якої інформація в АС перестає існувати для фізичних або юридичних осіб, що мають право власності на її в повному або обмеженому обсязі.",
            "результат дій порушника, унаслідок яких інформація стає відомою (доступною) суб'єктам, що не мають права доступу до неї."
        ],
        correctAnswers: [
            "дія, унаслідок якої інформація в АС перестає існувати для фізичних або юридичних осіб, що мають право власності на її в повному або обмеженому обсязі."
        ]
    },
    {
        id: 90,
        question: "Інформація -",
        options: [
            "це документовані або привселюдно оголошені відомості про події і явища, що відбуваються в товаристві, державі або навколишньому природному середовищі.",
            "дія, унаслідок якої інформація в АС перестає існувати для фізичних або юридичних осіб, що мають право власності на її в повному або обмеженому обсязі."
        ],
        correctAnswers: [
            "це документовані або привселюдно оголошені відомості про події і явища, що відбуваються в товаристві, державі або навколишньому природному середовищі."
        ]
    },
    {
        id: 91,
        question: "За загальним правилом будь-яка особа, якій завдано збитків у результаті порушення її цивільних прав, має право на їх відшкодування. Збитками визнаються:",
        options: [
            "вчинення будь-якою особою дій, які порушують особисті немайнові права суб'єктів авторського права і (або) суміжних прав та їх майнові права",
            "втрати, яких особа зазнала у зв'язку зі знищенням або пошкодженням речі, а також витрати, які особа зробила або вимушена зробити для відновлення свого порушеного права (реальні збитки)",
            "доходи, які спрямовані на набуття, зміну або припинення цивільних прав і обов'язків"
        ],
        correctAnswers: [
            "втрати, яких особа зазнала у зв'язку зі знищенням або пошкодженням речі, а також витрати, які особа зробила або вимушена зробити для відновлення свого порушеного права (реальні збитки)"
        ]
    },
    {
        id: 92,
        question: "Відповідно до Закону України 'Про інформацію', інформація - це...",
        options: [
            "зафіксоване на носії уявлення про предмети, процеси, явища",
            "будь-які відомості, що містяться у формі документів та картотек",
            "дані, що можуть фіксуватися в електронному та паперовому вигляді",
            "будь-які відомості та/або дані, що можуть бути задукоментовані або відображені в електронному вигляді"
        ],
        correctAnswers: [
            "будь-які відомості та/або дані, що можуть бути задукоментовані або відображені в електронному вигляді"
        ]
    },
    {
        id: 93,
        question: "Які три структурні елементи становлять інформаційну безпеку України?",
        options: [
            "інформаційна безпека в галузі зв'язку; інформаційно-правова безпека; інформаційно-технічна безпека",
            "інформаційна безпека в сфері комп'ютерних мереж; інформаційно-організаційна безпека; інформаційно-соціологічна безпека",
            "інформаційна безпека в сфері прав і свобод людини та громадянина; інформаційно-психологічна безпека; інформаційно-технічна безпека",
            "інформаційна безпека в сфері прав і свобод людини та громадянина; інформаційно-організаційна безпека; інформаційно-технічна безпека"
        ],
        correctAnswers: [
            "інформаційна безпека в сфері прав і свобод людини та громадянина; інформаційно-психологічна безпека; інформаційно-технічна безпека"
        ]
    },
    {
        id: 94,
        question: "Під нормативно-правовим регулюванням інформаційної безпеки України розуміється",
        options: [
            "форма впливу на інформаційні відносини, що здійснюється підприємствами, установами та організаціями з метою їх упорядкування, охорони та захисту",
            "форма владного правового впливу на суспільні відносини, що здійснюється державою з метою їх упорядкування, закріплення та забезпечення",
            "форма адміністративного впливу на суспільні відносини, що здійснюється органами державної влади з метою їх упорядкування, закріплення та захисту"
        ],
        correctAnswers: [
            "форма владного правового впливу на суспільні відносини, що здійснюється державою з метою їх упорядкування, закріплення та забезпечення"
        ]
    },
    {
        id: 95,
        question: "Відповідальність за забезпечення захисту Інформації в системі покладається",
        options: [
            "тільки на керівників структурних підрозділів, що забезпечують створення та експлуатацію системи",
            "на керівника організації чи його заступника та керівників структурних підрозділів, що забезпечують створення та експлуатацію системи",
            "тільки на власника системи",
            "на всіх працівників організації"
        ],
        correctAnswers: [
            "тільки на власника системи"
        ]
    },
    {
        id: 96,
        question: "Відповідно до Закону України «Про інформацію» до видів інформації за змістом не відноситься:",
        options: [
            "інформація про товар",
            "правильної відповіді немає",
            "податкова інформація",
            "статистична інформація"
        ],
        correctAnswers: [
            "правильної відповіді немає"
        ]
    },
    {
        id: 97,
        question: "За режимом доступу інформація поділяється на:",
        options: [
            "Інформацію з обмеженим доступом, конфіденційну, відкриту",
            "інформацію з обмеженим доступом, відкриту",
            "службову, таємну. Інформацію з обмеженим доступом",
            "конфіденційну, службову, інформацію з обмеженим доступом",
            "секретну, відкриту, інформацію з обмеженим доступом"
        ],
        correctAnswers: [
            "інформацію з обмеженим доступом, відкриту"
        ]
    },
    {
        id: 98,
        question: "Правовий статус електронного цифрового підпису визначається:",
        options: [
            "Законом України «Про цифровий підпис та суміжні права»",
            "Законом України «Про електронний цифровий підпис»",
            "Законом України «Про криптографічний захист інформації»",
            "Законом України «Про державну таємницю»"
        ],
        correctAnswers: [
            "Законом України «Про електронний цифровий підпис»"
        ]
    },
    {
        "id": 99,
        "question": "Персональні дані - це відомості чи сукупність відомостей про фізичну особу, яка Ідентифікована або може бути конкретно ідентифікована",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 100,
        "question": "Вкажіть орган влади, на підставі рішення якого особу може бути притягнуто до відповідальності за створення з метою збуту технічних засобів, призначених для несанкціонованого втручання в роботу автоматизованих систем:",
        "options": [
            "Державна служба спеціального зв'язку та захисту інформації України",
            "Служба безпеки України",
            "Прокуратура України.",
            "Суди України"
        ],
        "correctAnswers": [
            "Служба безпеки України"
        ]
    },
    {
        "id": 101,
        "question": "Правила забезпечення захисту інформації в інформаційних, телекомунікаційних, та інформаційно-телекомунікаційних системах затверджено:",
        "options": [
            "постановою Кабінету Міністрів України",
            "указом Президента України",
            "наказом Адміністрації Державної служби спеціального зв'язку та захисту інформації України",
            "наказом Служби безпеки України"
        ],
        "correctAnswers": [
            "постановою Кабінету Міністрів України"
        ]
    },
    {
        "id": 102,
        "question": "Кожен може бути притягнутий до відповідальності за висловлення оціночних суджень",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 103,
        "question": "Виберіть нормативно-правовий акт, який не входить до спеціального блоку законодавства в галузі інформації:",
        "options": [
            "Закон України «Про захист інформації в інформаційно-телекомунікаційних системах»",
            "Закон України «Про захист персональних даних»",
            "Закон України «Про доступ до публічної інформації»",
            "Закон України «Про захист прав споживачів»"
        ],
        "correctAnswers": [
            "Закон України «Про захист прав споживачів»"
        ]
    },
    {
        "id": 104,
        "question": "Залежно від ступеня секретності Інформації, встановлюються такі форми допуску до державної таємниці:",
        "options": [
            "форма 1. форма 2, форма З",
            "форма 1, форма 2, форма 3, форма 4",
            "форма 1, форма 2, форма 3, форма 4, форма 5",
            "форма 1, форма 2"
        ],
        "correctAnswers": [
            "форма 1. форма 2, форма З"
        ]
    },
    {
        "id": 105,
        "question": "Не є суб'єктами відносин у сфері доступу до публічної інформації:",
        "options": [
            "структурний підрозділ або відповідальна особа з питань запитів на інформацію розпорядників інформації",
            "інші структурні підрозділи розпорядників інформації",
            "розпорядники інформації",
            "запитувачі інформації"
        ],
        "correctAnswers": [
            "інші структурні підрозділи розпорядників інформації"
        ]
    },
    {
        "id": 106,
        "question": "Запитувач публічної Інформації зобов'язаний вказати причину подання запиту на Інформацію",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 107,
        "question": "Судом може бути накладено заборону на поширення Інформації",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 108,
        "question": "Будь-яка інформація є відкритою, крім тієї, що віднесена законом до інформації з обмеженим доступом",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 109,
        "question": "Реалізація права на інформацію не повинно порушувати політичних прав інших громадян",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 110,
        "question": "Орган місцевого самоврядування не є суб'єктом владних повноважень, зокрема в сфері інформаційних відносин",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 111,
        "question": "Не відноситься до державної таємниці інформація:",
        "options": [
            "про державні шифри, їх розроблення, виробництво, технологію виготовлення та використання",
            "про організацію, зміст, стан і плани розвитку технічного захисту секретної інформації",
            "про стан здоров'я населення, його життєвий рівень",
            "про організацію режиму секретності в органах державної влади"
        ],
        "correctAnswers": [
            "про стан здоров'я населення, його життєвий рівень"
        ]
    },
    {
        "id": 112,
        "question": "Захист інформації це -",
        "options": [
            "сукупність організаційно-технічних заходів і правових норм для попередження заподіяння збитку інтересам власника інформації або АС і осіб, що користуються інформацією.",
            "дія, унаслідок якої інформація в АС перестає існувати для фізичних або юридичних осіб, що мають право власності на її в повному або обмеженому обсязі.",
            "сукупність усіх даних І програм, використовуваних в АС незалежно від засобу їх фізичного і логічного уявлення.",
            "система, що здійснює автоматизоване опрацювання даних, до складу якої входять технічні засоби опрацювання (засоби обчислювальної техніки і зв'язку), а також методи, процедури і програмне забезпечення."
        ],
        "correctAnswers": [
            "сукупність організаційно-технічних заходів і правових норм для попередження заподіяння збитку інтересам власника інформації або АС і осіб, що користуються інформацією."
        ]
    },
    {
        "id": 113,
        "question": "Втрата Інформації - це результат дій порушника, унаслідок яких інформація стає відомою (доступною) суб’єктам, що не мають права доступу до неї.",
        "options": [
            "Ні",
            "так"
        ],
        "correctAnswers": [
            "Ні"
        ]
    },
    {
        "id": 114,
        "question": "Комп'ютерна Інформація це —",
        "options": [
            "комплекс технічних засобів, призначених для автоматичної обробки інформації в процесі вирішення обчислювальних та інформаційних задач;",
            "фізичні об'єкти, машинні носії, призначені для постійного зберігання, перенесення і обробки комп'ютерної інформації. До них відносяться гнучкі магнітні диски (дискети), жорсткі магнітні диски (вінчестери), касетні магнітні стрічки (стримери), магнітні барабани, магнітні карти тощо;",
            "сукупність взаємопов’язаних ЕОМ, периферійного обладнання та програмного забезпечення, призначених для автоматизації прийому, зберігання, обробки, пошуку І видачі інформації споживачам. Комп'ютерні системи можуть бути регіонального та галузевого характеру;",
            "це текстова, цифрова, графічна чи інша інформація (дані, відомості) про осіб, предмети, події, яка існує в електронному виді, зберігається на відповідних електронних носіях і може використовуватися, оброблятися або змінюватися за допомогою ЕОМ (комп'ютерів).",
            "це з'єднання декількох комп'ютерів (ЕОМ) та комп'ютерних систем, що взаємопов'язані і розташовані на фіксованій території та орієнтовані на колективне використання загальномережових ресурсів. Комп'ютерні мережі передбачають спільне використання ресурсів обчислювальних центрів (ОЦ). запуск загальних програм, які входять до комп'ютерних систем;"
        ],
        "correctAnswers": [
            "це текстова, цифрова, графічна чи інша інформація (дані, відомості) про осіб, предмети, події, яка існує в електронному виді, зберігається на відповідних електронних носіях і може використовуватися, оброблятися або змінюватися за допомогою ЕОМ (комп'ютерів)."
        ]
    },
    {
        "id": 115,
        "question": "Положення про порядок здійснення криптографічного захисту інформації затверджено:",
        "options": [
            "указом Президента України",
            "постановою Кабінету Міністрів України",
            "наказом Адміністрації Державної служби спеціального зв'язку та захисту Інформації України",
            "постановою Верховної Ради України"
        ],
        "correctAnswers": [
            "указом Президента України"
        ]
    },
    {
        "id": 116,
        "question": "Захисту в інформаційній системі не підлягає вся відкрита інформація, яка створена за державні кошти",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Неправильно"
        ]
    },
    {
        "id": 117,
        "question": "Запити на отримання доступу до публічної інформації подаються тільки юридичними особами",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Неправильно"
        ]
    },
    {
        "id": 118,
        "question": "Злочини, що посягають на інформаційну безпеку України, окрім Кримінального кодексу України, можуть визначатися й іншими законами",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 119,
        "question": "Допуск до державної таємниці - це надання повноважною посадовою особою дозволу громадянину на ознайомлення з конкретною секретною інформацією та провадження діяльності, пов'язаної з державною таємницею",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 120,
        "question": "Публічна інформація - це відображена та задокументована будь-якими засобами та на будь-яких носіях інформація, яка знаходиться у володінні суб'єктів владних повноважень",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 121,
        "question": "Фізична особа, яка поширює інформацію, не зобов'язана переконуватися в її достовірності",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 122,
        "question": "Фізична особа, яка поширює інформацію, отриману з офіційних джерел (інформація органів державної влади, органів місцевого самоврядування, звіти, стенограми тощо), не зобов'язана перевіряти її достовірність та не несе відповідальності в разі її спростування",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    },
    {
        "id": 123,
        "question": "Захист Інформації - це сукупність правових, адміністративних, організаційних, технічних та інших заходів, що забезпечують збереження, цілісність інформації та належний порядок доступу до неї",
        "options": [
            "Правильно",
            "Неправильно"
        ],
        "correctAnswers": [
            "Правильно"
        ]
    }
];