export const questionsTG = [
    {
        id: 2,
        question: 'Для виходу приватної мережі в Internet організація повинна отримати IP-адресу від:',
        options: [
            'адміністратора',
            'сервіс-провайдера',
            'організації InterNIC'
        ],
        correctAnswers: [
            'адміністратора'
        ]
    },
    {
        id: 3,
        question: 'Прямий і зворотній перехід з intranet-мережі в Intеrnet забезпечує протокол:',
        options: [
            'ТСР',
            'UDP',
            'NAT'
        ],
        correctAnswers: [
            'NAT'
        ]
    },
    {
        id: 4,
        question: 'Яке з’єднання використовують, здебільшого, мультимедіа-додатки:',
        options: [
            'ТСР',
            'UDP',
            'NAT'
        ],
        correctAnswers: [
            'UDP'
        ]
    },
    {
        id: 5,
        question: 'Який із способів розподілення ресурсів передбачає використання провайдером проміжних серверів:',
        options: [
            'web-кешування',
            'CDN-технологія',
            'Р2Р-технологія'
        ],
        correctAnswers: [
            'web-кешування'
        ]
    },
    {
        id: 6,
        question: 'Який протокол використовують, здебільшого, для доступу до інформації, розміщеної на WEB-сайтах?',
        options: [
            'ТFTP',
            'HTTP',
            'SMTP'
        ],
        correctAnswers: [
            'HTTP'
        ]
    },
    {
        id: 7,
        question: 'Який протокол використовується для відображення МАС-адреси в ІР-адресу ?',
        options: [
            'ARP',
            'DNS',
            'RARP',
            'SNMP'
        ],
        correctAnswers: [
            'RARP'
        ]
    },
    {
        id: 8,
        question: 'Яка з наведених адрес є адресою хоста мережі intranet:',
        options: [
            '192.168.0.255',
            '192.168.0.0',
            '192.168.1.0',
            '192.168.255.254'
        ],
        correctAnswers: [
            '192.168.255.254'
        ]
    },
    {
        id: 9,
        question: 'Яка з наведених адрес є публічною адресою:',
        options: [
            '172.31.0.1',
            '172.32.0.0',
            '172.15.1.1',
            '172.31.255.255'
        ],
        correctAnswers: [
            '172.15.1.1'
        ]
    },
    {
        id: 10,
        question: 'Доступ до бази керуючої інформації МІВ керованих вузлах забезпечує протокол :',
        options: [
            'SNMP',
            'DNS',
            'DHCP',
            'ІСМР'
        ],
        correctAnswers: [
            'SNMP'
        ]
    },
    {
        id: 11,
        question: 'Яка з наведених технологій просуває пакет з встановленням віртуального каналу:',
        options: [
            'ISDN',
            'АТМ',
            'PSTN'
        ],
        correctAnswers: [
            'АТМ'
        ]
    },
    {
        id: 12,
        question: 'Канал Е2 технології PDH забезпечує передавання даних такого числа абонентів:',
        options: [
            '30',
            '480',
            '120'
        ],
        correctAnswers: [
            '120'
        ]
    },
    {
        id: 13,
        question: 'Багатоканальні лінії зв’язку містять:',
        options: [
            'Трансивери',
            'Термінатори',
            'Модеми'
        ],
        correctAnswers: [
            'Термінатори'
        ]
    },
    {
        id: 14,
        question: 'Які способи ущільнення цифрових каналів Ви знаєте?',
        options: [
            'частотний',
            'часовий',
            'амплітудний'
        ],
        correctAnswers: [
            'частотний',
            'часовий'
        ]
    },
    {
        id: 15,
        question: 'Яка з технологій не гарантує дотримання параметрів QoS якості обслуговування:',
        options: [
            'MPLS',
            'АТМ',
            'Fram Relay',
            'Х.25'
        ],
        correctAnswers: [
            'Х.25'
        ]
    },
    {
        id: 16,
        question: 'Яка з наведених технологій забезпечує швидкість передавання даних до 10 Гбіт/сек:',
        options: [
            'SDH',
            'SMDS',
            'SONET',
            'АТМ'
        ],
        correctAnswers: [
            'SDH'
        ]
    },
    {
        id: 17,
        question: 'Маршрут пакету-це послідовність об’єктів, які повинен пройти пакет від джерела до адресата:',
        options: [
            'комутаційних центрів',
            'комп’ютерних мереж',
            'портів маршрутизаторів'
        ],
        correctAnswers: [
            'портів маршрутизаторів'
        ]
    },
    {
        id: 18,
        question: 'Виконані адміністратором записи в ТМ називають:',
        options: [
            'статичними',
            'динамічними',
            'адаптивними'
        ],
        correctAnswers: [
            'статичними'
        ]
    },
    {
        id: 19,
        question: 'На нижньому рівні 3-и рівневої мережі можуть використовуватися канали технології:',
        options: [
            'ТСР/ІР',
            'FDDI',
            'SDH'
        ],
        correctAnswers: [
            'SDH'
        ]
    },
    {
        id: 20,
        question: 'ТМ на проміжних вузлах будують, переважно, при використанні маршрутизації:',
        options: [
            'простої',
            'однокрокової',
            'багатокрокової'
        ],
        correctAnswers: [
            'багатокрокової'
        ]
    },
    {
        id: 21,
        question: 'Протоколами якого рівня будуються і доповнюються ТМ адаптивної однокрокової маршрутизація :',
        options: [
            'транспортного',
            'мережевого',
            'мережевих інтерфейсів'
        ],
        correctAnswers: [
            'мережевого'
        ]
    },
    {
        id: 22,
        question: 'В різних версіях однокроковій маршрутизації в ТМ однозначно вказують:',
        options: [
            'вихідний порт даного R',
            'вхідний порт наступного R',
            'віддаль до мережі адресата',
            'адресу клієнта'
        ],
        correctAnswers: [
            'вхідний порт наступного R'
        ]
    },
    {
        id: 23,
        question: 'Який протокол встановлює маршрут пакету?',
        options: [
            'TCP',
            'UDP',
            'ІP',
            'DNS'
        ],
        correctAnswers: [
            'ІP'
        ]
    },
    {
        id: 24,
        question: 'В залежності від способу формування записів у ТМ однокрокова маршрутизація буває:',
        options: [
            'ієрархічною',
            'плаваючою',
            'динамічною',
            'тимчасовою'
        ],
        correctAnswers: [
            'динамічною'
        ]
    },
    {
        id: 25,
        question: 'Який з перелічених видів захисту передбачає заходи щодо відновлення інформаційної системи після її ураження?',
        options: [
            'фізичний',
            'процедурний',
            'технічний',
            'організаційний',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'процедурний'
        ]
    },
    {
        id: 26,
        question: 'Який з нижчеперелічених засобів пов\'язаний з визначенням користувачів, відповідальних за конкретні дії над інформацією в інформаційній системі?',
        options: [
            'автентифікація',
            'авторизація',
            'аудит',
            'цифровий електронний підпис',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'аудит'
        ]
    },
    {
        id: 27,
        question: 'Безпечна інформаційна система за визначенням повинна володіти властивостями:',
        options: [
            'антивірусного контролю',
            'цілісності та аудиту',
            'цілісності, доступності та конфіденційності',
            'таємності та аналізу комп’ютерного трафіку',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'цілісності, доступності та конфіденційності'
        ]
    },
    {
        id: 28,
        question: 'Згідно стандарту щодо управління інформаційною безпекою, «мозковий штурм» це:',
        options: [
            'тестування систем і сервісних програм постачальників у разі аварій',
            'тестування технічних заходів щодо відновлення інформаційної системи у відведений проміжок часу',
            'обговорення заходів щодо відновлення бізнесу в разі аварій',
            'тестування технічних заходів щодо відновлення в альтернативному місці',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'обговорення заходів щодо відновлення бізнесу в разі аварій'
        ]
    },
    {
        id: 29,
        question: 'Який прямий ефект дає розробка політики безпеки організації?',
        options: [
            'підвищення якості управління інформаційними ресурсами',
            'покращення ефективності управління',
            'забезпечення безперервності ведення бізнесу',
            'якість управління бізнесом у цілому',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'забезпечення безперервності ведення бізнесу'
        ]
    },
    {
        id: 30,
        question: 'Задача забезпечення інформаційної безпеки повинна вирішуватися:',
        options: [
            'на рівні керівництва',
            'на рівні керівництва та системних адміністраторів',
            'на рівні мережевих та системних адміністраторів',
            'на всіх рівнях в організації – від вищого керівництва до рядового працівника',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'на всіх рівнях в організації – від вищого керівництва до рядового працівника'
        ]
    },
    {
        id: 31,
        question: 'Засоби, які запобігають доступу до інформаційної системи небажаним особам і дозволяють доступ легальним користувачам, відносяться до:',
        options: [
            'засобів аудиту',
            'засобів авторизації',
            'засобів автентифікації',
            'засобів моніторингу',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'засобів автентифікації'
        ]
    },
    {
        id: 32,
        question: 'Розподіл відповідальності за забезпечення інформаційної безпеки організації вимагає щоб:',
        options: [
            'розмежування відповідальності було визначено між собою усіма працівниками організації',
            'розмежування відповідальності було визначено старшим адміністратором мережі',
            'розмежування відповідальності було закріплено документально',
            'розмежування відповідальності стосувалося лише тих працівників, які безпосередньо пов’язані із захистом інформації',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'розмежування відповідальності було закріплено документально'
        ]
    },
    {
        id: 33,
        question: 'Відповідно до стандарту, необхідно включати задачу забезпечення безпеки організації в посадові обов\'язки:',
        options: [
            'усіх працівників',
            'керівника та менеджерів організації',
            'керівників відділів, менеджерів та системних адміністраторів організації',
            'осіб, безпосередньо відповідальних за забезпечення безпеки організації',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'усіх працівників'
        ]
    },
    {
        id: 34,
        question: 'До обов’язків якої посадової особи організації, відноситься питання щодо підтримки корпоративних методик захисту інформаційних технологій і директив:',
        options: [
            'кваліфікованого працівника з інформаційних технологій',
            'контролера безпеки інформаційних технологій',
            'головного адміністратора корпорації',
            'фахового менеджера організації',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'контролера безпеки інформаційних технологій'
        ]
    },
    {
        id: 35,
        question: 'Найважливішою частиною процесу керування безпекою інформаційних технологій є:',
        options: [
            'розроблення корпоративних засобів захисту інформаційних ресурсів',
            'створення плану стосовно підтримки і керування інформаційним трафіком',
            'оцінка ризиків і визначення способу, яким їх можна привести до допустимого рівня',
            'оцінка ризиків втрати конфіденційності публічних даних',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'оцінка ризиків і визначення способу, яким їх можна привести до допустимого рівня'
        ]
    },
    {
        id: 36,
        question: 'Основна мета створення форуму з інформаційної безпеки полягає у:',
        options: [
            'обміні інформацією щодо аналізу і оновлення інфраструктури організації',
            'виявленні порушень експлуатації інформаційних систем',
            'виключенні проблем, пов\'язаних з недостатньою інформованістю задіяних у процесі забезпечення безпеки осіб',
            'забороні застосовувати програмне забезпечення закордонного виробництва',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'виключенні проблем, пов\'язаних з недостатньою інформованістю задіяних у процесі забезпечення безпеки осіб'
        ]
    },
    {
        id: 37,
        question: 'До якого ключового механізму стандарту з управління інформаційною безпекою відноситься вимога укладання угод про дотримання режиму інформаційної безпеки з усіма працівниками?',
        options: [
            'організаційні заходи щодо забезпечення безпеки',
            'безпека персоналу',
            'фізична безпека',
            'управління доступом до ресурсів ІС',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'безпека персоналу'
        ]
    },
    {
        id: 38,
        question: 'Координація питань, пов\'язаних з інформаційною безпекою належить до:',
        options: [
            'фізичних заходів щодо забезпечення безпеки',
            'заходів щодо безпеки персоналу',
            'виключно до компетенції системного адміністратора',
            'організаційних заходів щодо забезпечення безпеки',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'організаційних заходів щодо забезпечення безпеки'
        ]
    },
    {
        id: 39,
        question: 'Який основний захід повинен бути ужитий щодо захисту інформаційної системи від вірусних програм?',
        options: [
            'обов\'язковість вживання лише ліцензійного програмного забезпечення',
            'застосування процедур автентифікації',
            'застосування процедур шифрування повідомлень',
            'застосування процедури цифрового підпису на прикладне програмне забезпечення',
            'проведення модернізації операційних систем'
        ],
        correctAnswers: [
            'обов\'язковість вживання лише ліцензійного програмного забезпечення'
        ]
    },
    {
        id: 40,
        question: 'Яку першочергову перевірку стосовно засобів захисту необхідно виконати після огляду аналізування ризику активів організації?',
        options: [
            'перевірку стосовно правильного підключення до мережі засобів захисту',
            'перевірку стосовно правильної класифікації засобів захисту',
            'перевірку засобів захисту на сумісність',
            'перевірку правильної експлуатації кожного засобу захисту',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'перевірку засобів захисту на сумісність'
        ]
    },
    {
        id: 41,
        question: 'Назвіть умову, при якій виникає необхідність детального аналізування ризику для інформаційної системи:',
        options: [
            'значення активів мають високі рівні ризику',
            'наявні лише засоби захисту для системи інформаційних технологій від найзагальніших загроз',
            'застосування основного підходу стосовно оцінки ризиків для системи',
            'коли вибрана мінімальну кількість стандартів для захисту секретних даних',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'значення активів мають високі рівні ризику'
        ]
    },
    {
        id: 42,
        question: 'Засоби, які контролюють доступ легальних користувачів до ресурсів інформаційної системи згідно їх повноважень, відносяться до:',
        options: [
            'засобів аудиту',
            'засобів авторизації',
            'засобів автентифікації',
            'засобів моніторингу',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'засобів авторизації'
        ]
    },
    {
        id: 43,
        question: 'До яких з перелічених відносяться системи, що можуть визначити потенційну можливість реалізації атак?',
        options: [
            'системи контролю цілісності',
            'системи контролю змісту',
            'системи аналізу захищеності',
            'системи аудиту',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'системи аналізу захищеності'
        ]
    },
    {
        id: 44,
        question: 'Легальний моніторинг інформаційної системи легальним користувачем відноситься до?',
        options: [
            'ненавмисної загрози',
            'активної загрози',
            'правильна відповідь відсутня',
        ],
        correctAnswers: [
            'правильна відповідь відсутня'
        ]
    },
    {
        id: 45,
        question: 'Засоби, які запобігають доступу до інформаційної системи небажаним особам і дозволяють доступ легальним користувачам, відносяться до:',
        options: [
            'засобів аудиту',
            'засобів авторизації',
            'засобів автентифікації',
            'засобів моніторингу',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'засобів автентифікації'
        ]
    },
    {
        id: 46,
        question: 'До якого виду загроз можна віднести нелегальні дії хакера в інформаційній системи, реалізація яких привела до втрати даних у папках користувача?',
        options: [
            'ненавмисних',
            'випадкових',
            'навмисних активних',
            'навмисних пасивних',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'навмисних активних'
        ]
    },
    {
        id: 47,
        question: 'Які з перелічених технологій, за своїм визначенням, застосовується для шифрування трафіку в каналі передачі?',
        options: [
            'технологія NApT',
            'технологія СIDR',
            'системи аналізу захищеності',
            'технологія VPN',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'технологія VPN'
        ]
    },
    {
        id: 48,
        question: 'Які пристрої дозволяють здійснювати фільтрацію графіку на основі лише МАС- адрес фреймів?',
        options: [
            'VLAN комутатори',
            'пакетні фільтри',
            'сеансові посередники',
            'шлюзи прикладного рівня',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'VLAN комутатори'
        ]
    },
    {
        id: 49,
        question: 'До яких процедур рекомендовано переходити після завершення атестації інформаційної системи?',
        options: [
            'до процедур верифікації',
            'до процедур вибору засобів технічного захисту',
            'до процедур доопрацювання',
            'до процедур вибору систем захисту',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'до процедур доопрацювання'
        ]
    },
    {
        id: 50,
        question: 'Яка з перелічених програм, за визначенням, емулює запуск прикладної програми в безпечному віртуальному оточенні, перед її запуском на комп’ютері користувача?',
        options: [
            'сигнатурний аналізатор',
            'евристичний аналізатор',
            'санаційний аналізатор',
            'поведінковий блокиратор',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'евристичний аналізатор'
        ]
    },
    {
        id: 51,
        question: 'Що означає термін "інформація" в контексті технічного захисту інформації?',
        options: [
            'Відомості про суб\'єкти, об\'єкти, явища та процеси',
            'Відомості з обмеженим доступом',
            'Відомості, право доступу до якої обмежено встановленими правовими нормами',
            'Конфіденційні відомості',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'Відомості про суб\'єкти, об\'єкти, явища та процеси'
        ]
    },
    {
        id: 52,
        question: 'Яке визначення терміна "таємна інформація" є вірним?',
        options: [
            'Інформація, право доступу до якої обмежено встановленими правовими нормами',
            'Інформація з обмеженим доступом, яка містить відомості, що становлять державну або іншу передбачену законом таємницю',
            'Інформація, якою володіють, користуються чи розпоряджаються окремі фізичні чи юридичні особи або держава',
            'Формалізований опис методів та засобів здійснення захисту інформації',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'Інформація з обмеженим доступом, яка містить відомості, що становлять державну або іншу передбачену законом таємницю'
        ]
    },
    {
        id: 53,
        question: 'Що означає термін "витік інформації"?',
        options: [
            'Вплив на технічні засоби, що призводить до здійснення загрози для інформації',
            'Розповсюдження спотвореної інформації',
            'Унеможливлення санкціонованого доступу до інформації',
            'Неконтрольоване поширення інформації, яке призводить до її несанкціонованого одержання',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'Неконтрольоване поширення інформації, яке призводить до її несанкціонованого одержання'
        ]
    },
    {
        id: 54,
        question: 'Як визначається "спеціальний вплив" в контексті технічного захисту інформації?',
        options: [
            'Неконтрольоване поширення інформації, яке призводить до її несанкціонованого одержання',
            'Формалізований опис методів та засобів здійснення впливу на інформацію',
            'Вплив на технічні засоби, що призводить до здійснення загрози для інформації',
            'Несанкціоноване здобування інформації за допомогою технічних засобів та її аналіз',
            'правильна відповідь відсутня'
        ],
        correctAnswers: [
            'Вплив на технічні засоби, що призводить до здійснення загрози для інформації'
        ]
    },
    {
        id: 55,
        question: 'Що означає термін "носій інформації (ТЗІ)"?',
        options: [
            'Матеріальний об\'єкт, що містить інформацію, яка підлягає захисту від загроз.',
            'Фізичні поля та (чи) хімічні речовини, що містять інформацію з обмеженим доступом.',
            'Сукупність носіїв інформації, середовища поширення та засобів технічної розвідки.'
        ],
        correctAnswers: [
            'Матеріальний об\'єкт, що містить інформацію, яка підлягає захисту від загроз.'
        ]
    },
    {
        id: 56,
        question: 'Що означає термін "інформативний сигнал (T3І)"?',
        options: [
            'Матеріальний об\'єкт, що містить інформацію, яка підлягає захисту від загроз.',
            'Фізичні поля та (чи) хімічні речовини, що містять інформацію з обмеженим доступом.',
            'Сукупність носіїв інформації, середовища поширення та засобів технічної розвідки.'
        ],
        correctAnswers: [
            'Фізичні поля та (чи) хімічні речовини, що містять інформацію з обмеженим доступом.'
        ]
    },
    {
        id: 57,
        question: 'Що означає термін "зона безпеки інформації"?',
        options: [
            'Простір, в межах якого інформація убезпечена.',
            'Сукупність організаційних структур, нормативно-правових документів та матеріально-технічної бази.',
            'Сукупність вимог, у тому числі нормованих, що визначаються режимом доступу до інформації та загрозами безпеці.'
        ],
        correctAnswers: [
            'Простір, в межах якого інформація убезпечена.'
        ]
    },
    {
        id: 58,
        question: 'Нормативні документи з ТЗІ поділяються на(виберіть декілька правильних відповідей):',
        options: [
            'Інструкції з технічного захисту інформації.',
            'Довідники з технічного аудиту інформаційних систем.',
            'Нормативні акти міжвідомчого значення, що реєструються у Міністерстві юстиції України.',
            'Нормативні документи міжвідомчого значення технічного характеру, що реєструються органом, уповноваженим Кабінетом Міністрів України.',
            'Стандарти з організації інформаційної безпеки.',
            'Нормативні документи із стандартизації у галузі ТЗІ.',
            'Нормативні документи щодо криптографічного захисту даних.',
            'Нормативні документи відомчого значення органів державної влади та органів місцевого самоврядування.',
            'Державні стандарти та прирівняні до них нормативні документи.'
        ],
        correctAnswers: [
            'Нормативні акти міжвідомчого значення, що реєструються у Міністерстві юстиції України.',
            'Нормативні документи міжвідомчого значення технічного характеру, що реєструються органом, уповноваженим Кабінетом Міністрів України.',
            'Нормативні документи із стандартизації у галузі ТЗІ.',
            'Нормативні документи відомчого значення органів державної влади та органів місцевого самоврядування.',
            'Державні стандарти та прирівняні до них нормативні документи.'
        ]
    },
    {
        id: 59,
        question: 'Що таке комп\'ютерна система?',
        options: [
            'Сукупність організаційно-технічних засобів.',
            'Сукупність програмно-апаратних засобів, призначених для обробки інформації.',
            'Організаційно-технічна система, що реалізує інформаційну технологію.'
        ],
        correctAnswers: [
            'Сукупність програмно-апаратних засобів, призначених для обробки інформації.'
        ]
    },
    {
        id: 60,
        question: 'Що таке загроза?',
        options: [
            'Обставини або події, що можуть бути причиною порушення політики безпеки інформації.',
            'Стан інформації, в якому забезпечується збереження властивостей інформації.',
            'Діяльність, спрямована на забезпечення безпеки оброблюваної в АС інформації та АС в цілому.'
        ],
        correctAnswers: [
            'Обставини або події, що можуть бути причиною порушення політики безпеки інформації.'
        ]
    },
    {
        id: 61,
        question: 'Що таке авторизація?',
        options: [
            'Надання повноважень.',
            'Одержання користувачем або процесом інформації, що міститься в об’єкті.',
            'Сукупність заходів з визначення повноважень і прав доступу.'
        ],
        correctAnswers: [
            'Надання повноважень.'
        ]
    },
    {
        id: 62,
        question: 'Що таке модифікація?',
        options: [
            'Зміна користувачем або процесом інформації, що міститься в об’єкті.',
            'Передавання інформації від одного до іншого об’єкта КС.',
            'Вид взаємодії двох об’єктів КС.'
        ],
        correctAnswers: [
            'Зміна користувачем або процесом інформації, що міститься в об’єкті.'
        ]
    },
    {
        id: 63,
        question: 'Що таке конфіденційність інформації?',
        options: [
            'Технологія передачі інформації через відкриті мережі',
            'Процес захисту інформації від проникнення комп\'ютерних вірусів.',
            'Властивість інформації, яка полягає в тому, що інформація не може бути отримана неавторизованим користувачем і/або процесом.'
        ],
        correctAnswers: [
            'Властивість інформації, яка полягає в тому, що інформація не може бути отримана неавторизованим користувачем і/або процесом.'
        ]
    },
    {
        id: 64,
        question: 'Що таке критична інформація?',
        options: [
            'Властивість інформації, що описує її ступінь конфіденційності.',
            'Інформація, яка має бути доступна для всіх користувачів системи.',
            'Тип інформації, яка найчастіше піддається модифікації.',
            'Інформація, яка потребує посиленого захисту через свою важливість.'
        ],
        correctAnswers: [
            'Властивість інформації, що описує її ступінь конфіденційності.'
        ]
    },
    {
        id: 65,
        question: 'Що таке доступність в контексті інформаційної безпеки?',
        options: [
            'Властивість інформації, яка описує її ступінь захищеності від несанкціонованого доступу.',
            'Ступінь доступності інформації для користувачів у визначених часових рамках.',
            'Технологія, яка дозволяє зберігати інформацію на зовнішніх носіях.',
            'Процес захисту інформації від комп\'ютерних вірусів.'
        ],
        correctAnswers: [
            'Ступінь доступності інформації для користувачів у визначених часових рамках.'
        ]
    },
    {
        id: 66,
        question: 'Перевірка прав користувачів, що мають особливі привілеї для доступу в систему повинна проводитися згідно стандарту:',
        options: [
            'кожні чотири місяці',
            'кожні два місяці',
            'кожні три місяці',
            'кожен місяць',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['кожні три місяці']
    },
    {
        id: 67,
        question: 'Процес впровадження нової інформаційної системи вимагає щоб:',
        options: [
            'обов’язково були наявні локальні технології різних виробників в інформаційній системі',
            'обов’язково були наявні пристрої фізичного рівня в інформаційній системі',
            'усі компоненти, які впроваджуються повинні бути перевірені на сумісність з існуючими частинами системи',
            'обов’язково була створена демілітаризована зона інформаційної системи',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['усі компоненти, які впроваджуються повинні бути перевірені на сумісність з існуючими частинами системи']
    },
    {
        id: 68,
        question: 'Доступ користувачам до ресурсів інформаційної системи повинен надаватися:',
        options: [
            'лише після успішного проходження ними процесу ідентифікації',
            'лише після успішного проходження ними процесу ідентифікації і автентифікації',
            'будь-який користувач завжди повинен мати безперешкодний доступ до ресурсів інформаційної системи',
            'лише після успішного застосування ними цифрового підпису',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['лише після успішного проходження ними процесу ідентифікації і автентифікації']
    },
    {
        id: 69,
        question: 'До інформаційних ресурсів згідно стандарту належать:',
        options: [
            'системна документація',
            'системне апаратне забезпечення',
            'комутатори Ethernet',
            'модеми',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['системна документація']
    },
    {
        id: 70,
        question: 'Які з перелічених схем автентифікації переважно використовуються для перевірки лише віддалених користувачів?',
        options: [
            'схеми мережевої автентифікації на основі одноразового паролю',
            'схеми мережевої автентифікації на основі багаторазового паролю',
            'схеми автентифікації, які використовують Windows системи в межах LAN',
            'схеми мережевої автентифікації на основі одноразового та багаторазового паролів',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['схеми мережевої автентифікації на основі одноразового паролю']
    },
    {
        id: 71,
        question: 'Типовий Firewall за своїм визначенням:',
        options: [
            'розмежовує повноваження користувачів щодо доступу до його ресурсів',
            'обмежує або дозволяє проходження комп’ютерного трафіку за певною адресою',
            'організовує різнорівневі безпечні з’єднання «зовнішніх» користувачів з його службами',
            'розмежовує повноваження «корпоративних» користувачів щодо доступу до ресурсів серверів демілітаризованої зони',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['обмежує або дозволяє проходження комп’ютерного трафіку за певною адресою']
    },
    {
        id: 72,
        question: 'Механізм NAT може використовуватись міжмережевим екраном з метою:',
        options: [
            'захисту http і ftp серверів організації від ІР- Spoofing',
            'забезпечення контролю цілісності мережевого трафіку вузлів корпорації',
            'захист e-mail сервера на сеансовому рівні',
            'приховування мережних адрес усіх вузлів корпорації, а також топологію всієї корпоративної мережі',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['приховування мережних адрес усіх вузлів корпорації, а також топологію всієї корпоративної мережі']
    },
    {
        id: 73,
        question: 'До яких перелічених нижче комп’ютерних програм належать ті, характерною рисою яких є самореплікація?',
        options: [
            'програми-шпигуни',
            'програми-віруси',
            'спам',
            'руткіти',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['програми-віруси']
    },
    {
        id: 74,
        question: 'Яка з перелічених програм проактивного захисту, за визначенням, відслідковує підозрілі дії в реальних умовах?',
        options: [
            'сигнатурний аналізатор',
            'евристичний аналізатор',
            'санаційний аналізатор',
            'поведінковий блокиратор',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['поведінковий блокиратор']
    },
    {
        id: 75,
        question: 'Якому з перелічених методів виявлення вірусних програм, за визначенням, притаманна часова затримка при реакції на нові загрози?',
        options: [
            'сигнатурному',
            'евристичному',
            'проактивному',
            'поведінковому',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['сигнатурному']
    },
    {
        id: 76,
        question: 'Які з перелічених видів обмежень можуть впливати на вибір засобів захисту, що реалізуються в рамках життєвого циклу системи?',
        options: [
            'технічні',
            'фінансові',
            'юридичні',
            'часові',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['часові']
    },
    {
        id: 77,
        question: 'Якому з нижчеперелічених підходів вибору засобів захисту для зменшення ризиків властива суб\'єктивність поглядів і упередженість рецензентів?',
        options: [
            'основному',
            'змішаному',
            'неформальному',
            'рекомендаційному',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['неформальному']
    },
    {
        id: 78,
        question: 'З кількох кроків передбачається визначення величини ризику активам на основі використання процедури ранжування загроз?',
        options: [
            'чотирьох',
            'двох',
            'трьох',
            'п’ятьох',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['трьох']
    },
    {
        id: 79,
        question: 'До резервних копій повинен бути застосований адекватний ряд:',
        options: [
            'фізичних заходів захисту',
            'нормативно-правових заходів захисту',
            'програмних заходів захисту',
            'фізичних і організаційних заходів захисту',
            'організаційно-розпорядчих заходів захисту'
        ],
        correctAnswers: ['фізичних і організаційних заходів захисту']
    },
    {
        id: 80,
        question: 'Ведення системою журналу реєстрації подій дозволяє:',
        options: [
            'запобігти доступу до ресурсів мережі неавторизованим особам',
            'дізнатися ідентифікатор користувача, дату і час входу і виходу із системи',
            'вводити облікові записи користувачів мережі',
            'розмежувати права доступу користувачів до ресурсів мережі',
            'правильна відповідь відсутня'
        ],
        correctAnswers: ['дізнатися ідентифікатор користувача, дату і час входу і виходу із системи']
    }
];