export const questionsKSZI = [
    {
        id: 1,
        question: 'Хто затверджує Положення про СЗІ?',
        options: [
            'керівник організації-власник (розпорядник)',
            'начальник управління Держспецзв\'язку',
            'керівник РСВ',
            'юристконсульт',
            'головний бухгалтер',
            'начальник управління Служби безпеки України'
        ],
        correctAnswers: [
            'керівник організації-власник (розпорядник)'
        ]
    },
    {
        id: 2,
        question: 'На якому етапі створення КСЗІ створюється акт категоріювання?',
        options: [
            'введення КСЗІ і дію',
            'розробка політики безпеки інформації',
            'формування вимог до КСЗІ',
            'супровід КСЗІ',
            'розробка проекту КСЗІ',
            'розробка технічного завдання на створення КСЗІ'
        ],
        correctAnswers: [
            'формування вимог до КСЗІ'
        ]
    },
    {
        id: 3,
        question: 'На якому етапі створення КСЗІ створюється акт обстеження середовищ функціонування ІТС?',
        options: [
            'розробка технічного завдання на сворення КСЗІ',
            'проектування КСЗІ',
            'формування вимог до КСЗІ',
            'розробка політики безпеки інформації',
            'супроводження КСЗІ',
            'введення КСЗІ в дію'
        ],
        correctAnswers: [
            'формування вимог до КСЗІ'
        ]
    },
    {
        id: 4,
        question: 'На якому етапі створення КСЗІ оформляється План захисту?',
        options: [
            'розробка технічного завдання на сворення КСЗІ',
            'розробка політики безпеки інформації',
            'введення КСЗІ в дію',
            'формування вимог до КСЗІ',
            'розробка проекту КСЗІ',
            'супроводження КСЗІ'
        ],
        correctAnswers: [
            'розробка політики безпеки інформації'
        ]
    },
    {
        id: 5,
        question: 'На якому етапі створення КСЗІ проводиться дослідна експлуатація КСЗІ?',
        options: [
            'розробка технічного завдання на сворення КСЗІ',
            'супроводження КСЗІ',
            'розробка проекту КСЗІ',
            'розробка політики безпеки інформації',
            'введення КСЗІ в дію',
            'формування вимог до КСЗІ'
        ],
        correctAnswers: [
            'введення КСЗІ в дію'
        ]
    },
    {
        id: 6,
        question: 'На якому етапі створення КСЗІ проводиться державна експертиза КСЗІ?',
        options: [
            'розробка політики безпеки інформації',
            'формування вимог до КСЗІ',
            'розробка проекту КСЗІ',
            'супроводження КСЗІ',
            'розробка технічного завдання на сворення КСЗІ',
            'введення КСЗІ в дію'
        ],
        correctAnswers: [
            'введення КСЗІ в дію'
        ]
    },
    {
        id: 7,
        question: 'На якому етапі створення КСЗІ використовується інструкція з правил управління паролями в ІТС?',
        options: [
            'розробка політики безпеки інформації',
            'введення КСЗІ в дію',
            'формування вимог до КСЗІ',
            'супроводження КСЗІ',
            'розробка технічного завдання на створення КСЗІ',
            'розробка проекту КСЗІ'
        ],
        correctAnswers: [
            'введення КСЗІ в дію'
        ]
    },
    {
        id: 8,
        question: 'Які види документів використовується на етапі формування вимог до КСЗІ?',
        options: [
            'робочий проект КСЗІ',
            'інструкція про порядок проведення контролю режиму обробки та захисту інформації в ІТС',
            'наказ про призначення комісії з категоріювання',
            'модель порушника',
            'інструкція адміністратора безпеки в ІТС',
            'план захисту',
            'інструкція про порядок відновлювальних та ремонтних робіт ІТС',
            'технічне завдання на створення КСЗІ',
            'технічний проект КСЗІ',
            'правила управління паролями в ІТС'
        ],
        correctAnswers: [
            'наказ про призначення комісії з категоріювання',
            'модель порушника'
        ]
    },
    {
        id: 9,
        question: 'Які види документів використовується на етапі розробки політики безпеки інформації?',
        options: [
            'технічний проект КСЗІ',
            'інструкція про порядок проведення контролю режиму обробки та захисту інформації в ІТС',
            'робочий проект КСЗІ',
            'правила управління паролями в ІТС',
            'модель порушника',
            'наказ про призначення комісії з категоріювання',
            'інструкція про порядок відновлювальних та ремонтних робіт ІТС',
            'план захисту',
            'інструкція адміністратора безпеки в ІТС',
            'технічне завдання на створення КСЗІ'
        ],
        correctAnswers: [
            'план захисту'
        ]
    },
    {
        id: 10,
        question: 'Які види документів використовується на етапі розробки проекту КСЗІ?',
        options: [
            'робочий проект КСЗІ',
            'інструкція адміністратора безпеки в ІТС',
            'наказ про призначення комісії з категоріювання',
            'модель порушника',
            'технічне завдання на створення КСЗІ',
            'інструкція про порядок відновлювальних та ремонтних робіт ІТС',
            'технічний проект КСЗІ',
            'інструкція про порядок проведення контролю режиму обробки та захисту інформації в ІТС',
            'план захисту',
            'правила управління паролями в ІТС'
        ],
        correctAnswers: [
            'робочий проект КСЗІ',
            'технічний проект КСЗІ'
        ]
    },
    {
        id: 11,
        question: 'Які види документів використовується на етапі супроводження КСЗІ?',
        options: [
            'інструкція про порядок проведення контролю режиму обробки та захисту інформації в ІТС',
            'інструкція про порядок відновлювальних та ремонтних робіт ІТС',
            'модель порушника',
            'технічне завдання на створення КСЗІ',
            'технічний проект КСЗІ',
            'правила управління паролями в ІТС',
            'план захисту',
            'інструкція адміністратора безпеки в ІТС',
            'робочий проект КСЗІ',
            'наказ про призначення комісії з категоріювання'
        ],
        correctAnswers: [
            'інструкція про порядок проведення контролю режиму обробки та захисту інформації в ІТС',
            'інструкція про порядок відновлювальних та ремонтних робіт ІТС',
            'інструкція адміністратора безпеки в ІТС'
        ]
    },
    {
        id: 12,
        question: 'За якими результатами приймається рішення про необхідність створення КСЗІ?',
        options: [
            'оцінки можливих переваг',
            'моделі загроз',
            'визначення наявності у інформації, що обробляється в ІКС таких її видів, що потребують обмеження доступу',
            'моделі порушника',
            'ситуативного плану',
            'аналізу нормативно-правових актів'
        ],
        correctAnswers: [
            'визначення наявності у інформації, що обробляється в ІКС таких її видів, що потребують обмеження доступу'
        ]
    },
    {
        id: 13,
        question: 'До якого класу АС відноситься одномашинний однокористувачевий комплекс, який обробляє інформацію однієї або кількох ступенів обмеження доступу?',
        options: [
            'клас "2"',
            'клас "4"',
            'клас "2а"',
            'клас "3"',
            'клас "3а"',
            'клас "1"'
        ],
        correctAnswers: [
            'клас "1"'
        ]
    },
    {
        id: 14,
        question: 'До якого класу АС відноситься локалізований багатомашинний багатокористувачевий комплекс, який обробляє інформацію різних ступенів обмеження доступу?',
        options: [
            'клас "2а"',
            'клас "2"',
            'клас "4"',
            'клас "3а"',
            'клас "1"',
            'клас "3"'
        ],
        correctAnswers: [
            'клас "2"'
        ]
    },
    {
        id: 15,
        question: 'До якого класу АС відноситься розподілений багатомашинний багатокористувачевий комплекс, який обробляє інформацію різних ступенів обмеження доступу?',
        options: [
            'клас "2"',
            'клас "За"',
            'клас "З"',
            'клас "1"',
            'клас "2а"',
            'клас "4"'
        ],
        correctAnswers: [
            'клас "З"'
        ]
    },
    {
        id: 16,
        question: 'Який документ визначає повноваження та відповідальність працівників СЗІ?',
        options: [
            'інструкція користувача ІТС',
            'правила видачі, вилучення та обміну персональних ідентифікаторів, інших атрибутів розмежування доступу в ІТС',
            'положення про СЗІ',
            'інструкція системного адміністратора ІТС',
            'інструкція адміністратора безпеки в ІТС'
        ],
        correctAnswers: [
            'положення про СЗІ'
        ]
    },
    {
        id: 17,
        question: 'Які з наведених функцій відносяться до СЗІ (під час створення КСЗІ)?',
        options: [
            'вибір та налаштування апаратно-програмних засобів на об\'єктах електронно-обчислювальної техніки',
            'визначення переліків відомостей',
            'розробка та коригування моделі загроз',
            'розробка та коригування архітектури АС',
            'визначення і формування вимог до КСЗІ',
            'розробка та актуалізація мережевої інфраструктури АС',
            'участь у розробці нормативних документів, чинних у межах організації і АС',
            'розробка та коригування моделі загроз і моделі захисту інформації в АС'
        ],
        correctAnswers: [
            'визначення переліків відомостей',
            'розробка та коригування моделі загроз',
            'визначення і формування вимог до КСЗІ'
        ]
    },
    {
        id: 18,
        question: 'Які з наведених функцій відносяться до СЗІ (під час експлутації КСЗІ)?',
        options: [
            'організація процесу керування КСЗІ',
            'розробка та актуалізація мережевої інфраструктури АС',
            'розробка та коригування архітектури АС',
            'організація керування доступом до ресурсів АС',
            'участь в роботах з модернізації АС',
            'розробка та коригування моделі загроз і моделі захисту інформації в АС'
        ],
        correctAnswers: [
            'організація процесу керування КСЗІ',
            'організація керування доступом до ресурсів АС',
            'участь в роботах з модернізації АС'
        ]
    },
    {
        id: 19,
        question: 'Які з наведених функцій відносяться до СЗІ (з організації навчання персоналу з питань забезпечення захисту інформації)?',
        options: [
            'визначення переліків відомостей',
            'розробка та актуалізація мережевої інфраструктури АС',
            'розроблення планів навчання',
            'розробка та коригування архітектури АС',
            'проведення навчання користувачів',
            'взаємодія з учбовими закладами'
        ],
        correctAnswers: [
            'розроблення планів навчання',
            'проведення навчання користувачів',
            'взаємодія з учбовими закладами'
        ]
    },
    {
        id: 20,
        question: 'Як називається категоріювання ІТС, що здійснюєтья у разі її створення?',
        options: [
            'первинне',
            'державне',
            `обов'язкове`,
            'чергове',
            'службове',
            'планове',
            'позачергове',
            'експертне'
        ],
        correctAnswers: [
            'первинне'
        ]
    },
    {
        id: 21,
        question: 'Протягом якого терміну акт категоріювання є чинним?',
        options: [
            '3 роки',
            '1 рік',
            '2 роки',
            '5 років',
            'до зміни ознаки, за якою була встановлена категорія, але не більше 4 роки',
            '6 місяців'
        ],
        correctAnswers: [
            '5 років'
        ]
    },
    {
        id: 22,
        question: 'Обстеження якого елемента ІТС передбачає аналіз і опис класу і структури ІТС, аналіз зв\'язку та апаратно-програмних засобів?',
        options: [
            'мережевого середовища',
            'середовища користувачів',
            'обчислювальної системи',
            'фізичного середовища',
            'інформаційного середовищи',
            'зовнішнього середовища'
        ],
        correctAnswers: [
            'обчислювальної системи'
        ]
    },
    {
        id: 23,
        question: 'Обстеження якого елемента ІТС передбачає аналіз інформації та її класифікація?',
        options: [
            'середовища користувачів',
            'обчислювальної системи',
            'зовнішнього середовища',
            'мережевого середовища',
            'оточуючого середовища',
            'фізичного середовища',
            'інформаційного середовища'
        ],
        correctAnswers: [
            'інформаційного середовища'
        ]
    },
    {
        id: 24,
        question: 'Формуляр ІТС складаєтья за результатами',
        options: [
            'дослідної експлуатації ІТС',
            'проектування КСЗІ',
            'обстеження середовищ функціонування',
            'експертизи КСЗІ',
            'атестації КСЗІ',
            'категоріювання ІТС',
            'моделювання загороз і аналізу ризиків',
            'впровадження КСЗІ'
        ],
        correctAnswers: [
            'обстеження середовищ функціонування'
        ]
    },
    {
        id: 25,
        question: 'Які розділи містить Положення про СЗІ',
        options: [
            'загальні положення',
            'функції СЗІ',
            'політики безпеки СЗІ',
            'завдання СЗІ',
            'взаємодія СЗІ з іншими підрозділами організації та зовнішніми підприємствами',
            'модель загроз інформації',
            'штатний розклад та структура СЗІ',
            'акт обстеження середовищ функціонування СЗІ',
            'модель порушника',
            'повноваження і відповідальність СЗІ',
            'організація та фінансування робіт СЗІ'
        ],
        correctAnswers: [
            'загальні положення',
            'функції СЗІ',
            'завдання СЗІ',
            'взаємодія СЗІ з іншими підрозділами організації та зовнішніми підприємствами',
            'штатний розклад та структура СЗІ',
            'повноваження і відповідальність СЗІ',
            'організація та фінансування робіт СЗІ'
        ]
    },
    {
        id: 26,
        question: 'За результатами якого обстеження складається перелік Інформації, що підлягає автоматизованому обробленню в ІТСІ потребує захисту?',
        options: [
            'оточуюче середовище',
            'середовища користувачів',
            'фізичного середовища',
            'обчислювальної системи',
            'мережевого середовища',
            'інформаційного середовища',
            'середовища візуалізації'
        ],
        correctAnswers: [
            'інформаційного середовища'
        ]
    },
    {
        id: 27,
        question: 'На якому етапі створення КСЗІ складаєтья модель загроз?',
        options: [
            'розробка політики безпеки інформації',
            'введення КСЗІ в дію',
            'формування вимог до КСЗІ',
            'розробка проекту КСЗІ',
            'розробка технічного завдання на сворення КСЗІ',
            'супроводження КСЗІ'
        ],
        correctAnswers: [
            'формування вимог до КСЗІ'
        ]
    },

    {
        id: 28,
        question: 'На якому етапі створення КСЗІ проводиться навчання кристувачів?',
        options: [
            'розробка технічного завдання на сворення КСЗІ',
            'формування вимог до КСЗІ',
            'розробка політики безпеки Інформації',
            'супроводження КСЗІ',
            'введення КСЗІ в дію'
        ],
        correctAnswers: [
            'введення КСЗІ в дію'
        ]
    },
    {
        id: 29,
        question: 'Які види категоріювання ІТС можуть бути?',
        options: [
            'планове',
            'службове',
            'позачергове',
            'експертне',
            'державне',
            `обов'язкове`,
            'чергове',
            'первинне'
        ],
        correctAnswers: [
            'позачергове',
            'чергове',
            'первинне'
        ]
    },
    {
        id: 30,
        question: 'Як називається категоріювання ІТС, що здійснюється не рідше ніж один раз на 5 років?',
        options: [
            'планове',
            'позачергове',
            'експертне',
            'первинне',
            'службове',
            'державне',
            `обов'язкове`,
            'чергове'
        ],
        correctAnswers: [
            'чергове'
        ]
    },
    {
        id: 31,
        question: 'Як називається категоріювання ІТС, що здійснюється у разі зміни ознаки, за якою була встановлена категорія ІТС?',
        options: [
            'чергове',
            'службове',
            'планове',
            'позачергове',
            'експертне',
            `обов'язкове`,
            'первинне',
            'державне'
        ],
        correctAnswers: [
            'позачергове'
        ]
    },
    {
        id: 32,
        question: 'Положення про СЗІ затверджується',
        options: [
            'начальником управління Служби безпеки Інформації',
            'керівником РСВ',
            'начальником управління Держспецзв\'язку',
            'керівником СЗІ',
            'керівником організації'
        ],
        correctAnswers: [
            'керівником СЗІ'
        ]
    },
    {
        id: 33,
        question: 'Вкажіть правильну послідовність етапів створення КСЗІ',
        options: [
            '1 - розробка політики безпеки інформації, 2 - формування вмог, 3 - розробка технічного завдання, 4 - розробка проекту, 5 - введення в дію, 6 - супроводження',
            '1 - формування вмог, 2 - розробка технічного завдання, 3 - розробка політики безпеки інформації, 4 - розробка проекту, Б - введення в дію, б - супроводження',
            '1 - формування вимог, 2 - розробка політики безпеки інформації, 3 - розробка технічного завдання, 4 - розробка проекту, 5 - введення в дію, 6 – супроводження',
            '1 - розробка технічного завдання, 2 - розробка політики безпеки інформації, 3 -формування вмог, 4 - розробка проекту, 5 - введення в дію, б - супроводження',
            '1 - розробка технічного завдання, 2 - формування вмог, 3 - розробка політики безпеки інформації, 4 - розробка проекту, 5 - введення в дію, 6 - супроводження'
        ],
        correctAnswers: [
            '1 - формування вимог, 2 - розробка політики безпеки інформації, 3 - розробка технічного завдання, 4 - розробка проекту, 5 - введення в дію, 6 – супроводження'
        ]
    },
    {
        id: 34,
        question: 'На якому етапі створення КСЗІ приймається положення про службу захисту інформації',
        options: [
            'розробка проекту КСЗІ',
            'формування вимог до КСЗІ',
            'супроводження КСЗІ',
            'розробка політики безпеки інформації',
            'введення КСЗІ в дію',
            'розробка технічного завдання на сворення КСЗІ'
        ],
        correctAnswers: [
            'формування вимог до КСЗІ'
        ]
    },
    {
        id: 35,
        question: 'Який документ створюється за результатами категоріювання ІТС?',
        options: [
            'ситуаційний план',
            'модель загроз',
            'відомість категоріювання',
            'звіті категоріювання',
            'акт категоріювання',
            'положеня категоріювання'
        ],
        correctAnswers: [
            'акт категоріювання'
        ]
    },
    {
        id: 36,
        question: 'Обстеження якого елемента ІТС передбачає аналіз функціонального та кількісного складу користувачів, їх повноважень та рівня можливостей?',
        options: [
            'зовнішнього середовища',
            'середовища користувачів',
            'обчислювальної системи',
            'мережевого середовища',
            'інформаційного середовищи',
            'фізичного середовища'
        ],
        correctAnswers: [
            'середовища користувачів'
        ]
    },
    {
        id: 37,
        question: 'Вкажіть правильний порядок етапів захисту від загроз',
        options: [
            'зупинення, нейтралізація, виявлення, попередження',
            'попередження, виявлення, нейтралізація, зупинення',
            'виявлення, нейтралізація, зупинення, попередження',
            'виявлення, зупинення, нейтралізація, попередження'
        ],
        correctAnswers: [
            'виявлення, зупинення, нейтралізація, попередження'
        ]
    },
    {
        id: 38,
        question: 'Для захисту від яких видів загроз створюється КСЗІ?',
        options: [
            'спеціального впливу',
            'оброблення',
            'розповсюдження',
            'витоку технічними каналами',
            'несанкціонованих дій з інформацією'
        ],
        correctAnswers: [
            'спеціального впливу',
            'витоку технічними каналами',
            'несанкціонованих дій з інформацією'
        ]
    },
    {
        id: 39,
        question: 'Яке поняття визначає нездатність системи протистояти реалізації певної загрози або сукупності загроз?',
        options: [
            'відмова',
            'доступність',
            'атака',
            'вразливість',
            'ризик'
        ],
        correctAnswers: [
            'вразливість'
        ]
    },
    {
        id: 40,
        question: 'Яке поняття визначає втрату здатності КС або її компонента виконувати певну функцію?',
        options: [
            'ризик',
            'атака',
            'вразливість',
            'загроза',
            'відмова'
        ],
        correctAnswers: [
            'відмова'
        ]
    },
    {
        id: 41,
        question: 'Обстеження середовища функціонування ІТС проводиться в таких категоріях',
        options: [
            'середовище візуалізації',
            'середовище користувачів',
            'фізичне середовище',
            'інформаційне середовище',
            'оточуюче середовище',
            'зовнішнє середовище',
            'середовище поширення',
            'обчислювальна система',
            'мережеве середовище'
        ],
        correctAnswers: [
            'середовище користувачів',
            'фізичне середовище',
            'інформаційне середовище',
            'обчислювальна система'
        ]
    },
    {
        id: 42,
        question: 'На якому етапі захисту проводистья аналіз загроз, пошук нових запобіжних заходів, навчання І тренування персоналу?',
        options: [
            'нейтралізації',
            'попередження',
            'виявлення',
            'зупинення'
        ],
        correctAnswers: [
            'попередження'
        ]
    },
    {
        id: 43,
        question: 'Вкажіть, що з наведеного не є видом захисту інформації',
        options: [
            'організаційний',
            'криптографічний',
            'технічний',
            'нормативно-правовий',
            'Інженерний'
        ],
        correctAnswers: [
            'нормативно-правовий'
        ]
    },
    {
        id: 44,
        question: 'Який вплив на Інформацію в ІКС проводить технічний захист?',
        options: [
            'попереджує доступ до інформації за допомогою математичних перетворень',
            'попереджує руйнування носія внаслідок навмисних дій або природного впливу',
            'забезпечує обмеження доступу до носія інформації апаратно-технічними засобами',
            `попереджує доступу на об'єкт інформаційної діяльності сторонніх осіб`
        ],
        correctAnswers: [
            'забезпечує обмеження доступу до носія інформації апаратно-технічними засобами'
        ]
    },
    {
        id: 45,
        question: 'Яке поняття визначається, як функція ймовірності реалізації певної загрози, виду і величини завданих збитків?',
        options: [
            'доступність',
            'вразливість',
            'відмова',
            'ризик',
            'атака'
        ],
        correctAnswers: [
            'ризик'
        ]
    },
    {
        id: 46,
        question: 'На якому етапі створення КСЗІ використовується інструкція з антивірусного захисту інформації в ІТС?',
        options: [
            'формування вимог до КСЗІ',
            'розробка політики безпеки інформації',
            'супроводження КСЗІ',
            'розробка проекту КСЗІ',
            'введення КСЗІ в дію',
            'розробка технічного завдання на сворення КСЗІ'
        ],
        correctAnswers: [
            'супроводження КСЗІ'
        ]
    },
    {
        id: 47,
        question: 'Яке поняття визначає будь-які обставини або події, що можуть бути причиною порушення політики безпеки інформації і/або нанесення збитків АС?',
        options: [
            'загроза',
            'ризик',
            'вразливість',
            'атака',
            'доступність'
        ],
        correctAnswers: [
            'загроза'
        ]
    },
    {
        id: 48,
        question: 'Які засоби захисту реалізують інженерний вид захиту інформації?',
        options: [
            'антивіруси',
            'шифрування',
            'охорона',
            'відеоспостереження',
            'міжмережеві екрани'
        ],
        correctAnswers: [
            'охорона'
        ]
    },
    {
        id: 49,
        question: 'Який вид захисту попереджає доступ до інформації в ІКС?',
        options: [
            'криптографічний',
            'технічний організаційний',
            'інженерний',
            'нормативно-правовий'
        ],
        correctAnswers: [
            'криптографічний'
        ]
    },
    {
        id: 50,
        question: 'Який вид захисту інформації обмежує доступ до носія інформації в ІКС?',
        options: [
            'нормативно-правовий',
            'криптографічний',
            'організаційний',
            'інженерний',
            'технічний'
        ],
        correctAnswers: [
            'технічний'
        ]
    }
];