export const questionsCrypto = [
    {
        id: 1,
        question: 'Дайте визначення криптографії:',
        options: [
            'криптографія - це наука про захист інформації від несанкціонованого доступу сторонніх осіб;',
            'криптографія - наука про захист інформації від прочитання її сторонніми особами, що досягається шляхом шифрування і робить захищені дані марними для зловмисника;',
            'криптографія - це наука про захист інформації за допомогою математичних перетворень, які є симетричними;',
            'криптографія - це наука про захист інформації від несанкціонованого копіювання інформації;',
            'інша відповідь.',
        ],
        correctAnswers: [
            'криптографія - наука про захист інформації від прочитання її сторонніми особами, що досягається шляхом шифрування і робить захищені дані марними для зловмисника;'
        ]
    },
    {
        id: 2,
        question: 'Яка процедура розподілу ключів не потребує захищеного каналу для передачі секретного ключа адресату?',
        options: [
            'алгоритм Діффі-Хеллмана;',
            'алгоритм RSA;',
            'алгоритм DES;',
            'алгоритм RC-4;',
            'алгоритм DSA.'
        ],
        correctAnswers: [
            'алгоритм Діффі-Хеллмана;'
        ]
    },
    {
        id: 3,
        question: 'Для визначення якості шифру використовується поняття ...',
        options: [
            'криптостійкості;',
            'надійності;',
            'невразливості;',
            'довіреності;',
            'інша відповідь.'
        ],
        correctAnswers: [
            'криптостійкості;'
        ]
    },
    {
        id: 4,
        question: 'Яку довжину має секретний ключ криптосистеми DES?',
        options: [
            '56 біт із врахуванням контрольних розрядів;',
            '64 біт із врахуванням контрольних розрядів;',
            '128 біт;',
            '32 біти;',
            'інша відповідь.'
        ],
        correctAnswers: [
            '56 біт із врахуванням контрольних розрядів;'
        ]
    },
    {
        id: 5,
        question: 'Секретна система - це:',
        options: [
            'сукупність методів і алгоритмів шифрування, які забезпечують можливість криптографічного захисту даних;',
            'деяка множина відображень одного простору (множини можливих повідомлень) в інший простір (множини можливих криптограм), де кожне конкретне відображення з цієї множини відповідає способу шифрування за допомогою конкретного ключа;',
            'деяка множина відображень одного простору (множини можливих повідомлень) в інший простір (множини можливих криптограм), де кожне конкретне відображення з цієї множини відповідає способу шифрування за допомогою декількох ключів;',
            'системи маскування даних;',
            'інша відповідь.'
        ],
        correctAnswers: [
            'деяка множина відображень одного простору (множини можливих повідомлень) в інший простір (множини можливих криптограм), де кожне конкретне відображення з цієї множини відповідає способу шифрування за допомогою конкретного ключа;'
        ]
    },
    {
        id: 6,
        question: 'Заміна смислових конструкцій вихідної інформації (слів, речень) кодами називається:',
        options: [
            'шифруванням;',
            'дешифруванням;',
            'стисненням;',
            'кодуванням;',
            'маскуванням.'
        ],
        correctAnswers: [
            'кодуванням;'
        ]
    },
    {
        id: 7,
        question: 'Методи, які дозволяють приховати не тільки зміст, що зберігається або передається, а й сам факт зберігання або передачі секретної інформації відносяться до методів:',
        options: [
            'шифрування;',
            'кодування;',
            'стиснення;',
            'дешифрування;',
            'стеганографія.'
        ],
        correctAnswers: [
            'стеганографія.'
        ]
    },
    {
        id: 8,
        question: 'Процес дешифрування закритої інформації без знання ключа і, можливо, при відсутності відомостей про алгоритм шифрування називається:',
        options: [
            'повторним шифруванням;',
            'імовірнісним дешифруванням;',
            'криптоаналізом;',
            'зворотним шифруванням;',
            'дешифруванням.'
        ],
        correctAnswers: [
            'криптоаналізом;'
        ]
    },
    {
        id: 9,
        question: 'За характером використання ключа всі криптосистеми можна розділити на:',
        options: [
            'блокові і потокові;',
            'синхронні і асинхронні;',
            'симетричні і асиметричні;',
            'підстановки і перестановки;',
            'моноалфавітні і поліалфавітні;'
        ],
        correctAnswers: [
            'симетричні і асиметричні;'
        ]
    },
    {
        id: 10,
        question: 'У симетричних криптосистемах:',
        options: [
            'для шифрування і дешифрування завжди використовується різні алгоритми;',
            'для шифрування і дешифрування використовуються різні ключі;',
            'як для шифрування, так і для дешифрування застосовується один і той же ключ;',
            'ключ може бути доступним для всіх користувачів;',
            'використовуються два ключі: відкритий і секретний.'
        ],
        correctAnswers: [
            'як для шифрування, так і для дешифрування застосовується один і той же ключ;'
        ]
    },
    {
        id: 11,
        question: 'Найбільш відомим представником асиметричних систем шифрування є:',
        options: [
            'алгоритм Діффі-Хеллмана;',
            'алгоритм RSA;',
            'алгоритм DES;',
            'алгоритм RC-4;',
            'алгоритм DSA.'
        ],
        correctAnswers: [
            'алгоритм RSA;'
        ]
    },
    {
        id: 12,
        question: 'У потокових шифрах основною операцією шифрування є:',
        options: [
            'матричні перетворення;',
            'перетворення, засновані на обчисленнях з плаваючою точкою;',
            'обчислення логарифма в скінченому полі;',
            'операція додавання за модулем два;',
            'операція множення за модулем два.'
        ],
        correctAnswers: [
            'операція додавання за модулем два;'
        ]
    },
    {
        id: 13,
        question: 'У квадратичному конгруентному генераторі виду Xn = (aX2 n-1+bXn-1+c) mod m використовуються наступні значення: a = 2, b = 4, c = 21, m = 12, X0 = 2. Перший член послідовності такого генератора буде дорівнює …..',
        options: [
            '1;',
            '3;',
            '4;',
            '5;',
            '2.'
        ],
        correctAnswers: [
            '1;'
        ]
    },
    {
        id: 14,
        question: 'Лінійний конгруентний генератор виду Xn = (aXn-1+b) mod m використовує наступні значення: a =5, b = 7, X0 = 4. Перший член послідовності такого генератора вийшов рівним 7. Мінімальне значення m дорівнює:',
        options: [
            '2;',
            '4;',
            '7;',
            '10;',
            '3.'
        ],
        correctAnswers: ['2;']
    },
    {
        id: 15,
        question: 'Результатом шифрування повідомлення М=2 за алгоритмом RSA для наступних параметрів: р=7, q=11, e=13, d=37 буде С=….',
        options: [
            '30;',
            '3;',
            '6;',
            '4;',
            'Інша відповідь.'
        ],
        correctAnswers: ['30;']
    },
    {
        id: 16,
        question: 'До генераторів випадкових чисел належить:',
        options: [
            'метод квадратів;',
            'змішаний конгруентний;',
            'вимірювання температури зовнішнього середовища;',
            'Фібоначчі;',
            'BBS.'
        ],
        correctAnswers: ['вимірювання температури зовнішнього середовища;']
    },
    {
        id: 17,
        question: 'DES-алгоритм має ….. раунди (цикли) роботи:',
        options: [
            '28;',
            '16;',
            '8;',
            '32;'
        ],
        correctAnswers: ['16;']
    },
    {
        id: 18,
        question: 'Найбільш відомим представником систем потокового шифрування є:',
        options: [
            'алгоритм Діффі-Хеллмана;',
            'алгоритм RSA;',
            'алгоритм DSA;',
            'алгоритм DES;',
            'алгоритм RC4.'
        ],
        correctAnswers: ['алгоритм RC4.']
    },
    {
        id: 19,
        question: 'Результатом розшифрування повідомлення С=2, яке зашифроване за алгоритмом RSA із наступними параметрами: р=3, q=11, e=7, d=3 буде М=….',
        options: [
            '12;',
            '4;',
            '8;',
            '15;',
            'інша відповідь.'
        ],
        correctAnswers: ['8;']
    },
    {
        id: 20,
        question: 'Хеш-функцією називається …',
        options: [
            'шифрування даних;',
            'код аутентифікації;',
            'цифровий електронний підпис;',
            'криптографічні перетворення послідовності довільної довжини у послідовність фіксованої довжини;',
            'дешифрування даних.'
        ],
        correctAnswers: ['криптографічні перетворення послідовності довільної довжини у послідовність фіксованої довжини;']
    },
    {
        id: 21,
        question: 'Вихідний хеш-образ при використанні алгоритму SHA-1 має довжину….',
        options: [
            '64 біт;',
            '160 біт;',
            '128 біт;',
            '56 біт;',
            '256 біт.'
        ],
        correctAnswers: ['160 біт;']
    },
    {
        id: 22,
        question: 'Який алгоритм із нижче наведених використовується винятково для генерації цифрового електронного підпису?',
        options: [
            'RSA;.',
            'DES;',
            'DSA;',
            'MD;',
            'SHA.'
        ],
        correctAnswers: ['DSA;']
    },
    {
        id: 23,
        question: 'Розв’язком рівняння 9x = 7(mod10) є число:',
        options: [
            '3;',
            '2;',
            '9;',
            '5;',
            '7.'
        ],
        correctAnswers: ['3;']
    },
    {
        id: 24,
        question: 'Алгоритм Ель-Гамаля використовується для:',
        options: [
            'генерування ключів;',
            'кодування інформації;',
            'розподілу ключів;',
            'хеш-перетворень;',
            'шифрування інформації.'
        ],
        correctAnswers: ['шифрування інформації.']
    },
    {
        id: 25,
        question: 'Результатом шифрування повідомлення «підпис» за алгоритмом Цезаря із зсувом на 3 позиції вправо при використанні українського алфавіту без букви ґ буде:',
        options: [
            'фтжклр;',
            'лепові;',
            'ищлтів;',
            'ппаідл;',
            'ткжтйф.'
        ],
        correctAnswers: ['ткжтйф.']
    },
    {
        id: 26,
        question: 'Значення функції Ейлера φ(17) буде:',
        options: [
            '21;',
            '17;',
            '18;',
            '289;',
            '16.'
        ],
        correctAnswers: ['16.']
    },
    {
        id: 27,
        question: 'Значення функції Ейлера φ(8) буде:',
        options: [
            '5;',
            '9;',
            '7;',
            '4;',
            '3;'
        ],
        correctAnswers: ['4;']
    }
]